{"六十四卦":["乾：元，亨，利，贞。\n【白话】《乾卦》象征天：元始，亨通，和谐，贞正。\n《象》曰：天行健，君子以自强不息。\n【白话】《象辞》说：天道运行周而复始，永无止息，谁也不能阻挡，君子应效法天道，自立自强，不停地奋斗下去。\n\n抽得卦爻：{乾卦}",
"坤：元，亨，利牝马之贞。君子有攸往，先迷，后得主，利。西南得朋，东北丧朋。安贞吉。\n【白话】《坤卦》象征地：元始，亨通，如果像雌马那样柔顺，则是吉利的。君子从事某项事业，虽然开始时不知所从，但结果会是有利的。如往西南方，则会得到朋友的帮助。如往东南方，则会失去朋友的帮助。如果保持现状，也是吉利的。\n《象》曰：地势坤，君子以厚德载物。\n【白话】《象辞》说：坤象征大地，君子应效法大地，胸怀宽广，包容万物。\n\n抽得卦爻：{坤卦}",
"屯：元，亨，利，贞；勿用有攸往，利建侯。\n【白话】《屯卦》象征初生：元始，亨通，和谐，贞正。不要急于发展，首先要立君建国。\n《象》曰：云雷屯，君子以经纶。\n【白话】《象辞》说：《屯卦》的卦象是震（雷）下坎（水）上，为雷上有水之表象，水在上表示雨尚未落，故释为云。云雷大作，是即将下雨的征兆，故《屯卦》象征初生。这里表示天地初创，国家始建，正人君子应以全部才智投入到创建国家的事业中去。\n\n抽得卦爻：{屯卦}",
"蒙：亨。匪我求童蒙，童蒙求我；初筮告，再三渎，渎则不告。利贞。\n【白话】《蒙卦》象征启蒙：亨通。不是我有求于幼童，而是幼童有求于我，第一次向我请教，我有问必答，如果一而再、再而三地没有礼貌地乱问，则不予回答。利于守正道。\n《象》曰：山下出泉，蒙；君子以果行育德。\n【白话】《象辞》说：《蒙卦》的卦象是坎（水）下艮（山）上，为山下有泉水之表象，但要想发现甘泉，必须设法准确地找出泉水的位置，即意味着先必须进行启蒙教育。君子必须行动果断，才能培养出良好的品德。\n\n抽得卦爻：{蒙卦}",
"需：有孚，光亨，贞吉，利涉大川。\n【白话】《需卦》象征等待：具有诚实守信的品德，光明正大，做事才会亨通顺利，占问的结果是吉祥的，出外远行，渡过宽阔的河流会很顺利。\n《象》曰：云上于天，需；君子以饮食宴乐。\n【白话】《象辞》说：《需卦》的卦象是乾（天）下坎（水）上，为水在天上之表象。水汽聚集天上成为云层，密云満天，但还没有下雨，需要等待；君子在这个时候需要吃喝，饮酒作乐，即在等待的时候积蓄力量。\n\n抽得卦爻：{需卦}",
"讼：有孚窒惕，中吉；终凶，利见大人，不利涉大川。\n【白话】《讼卦》象征打官司：这是因为诚实守信的德行被阻塞，心中畏惧有所戒备引起，坚守正道居中不偏会有吉祥；坚持把官司打到底则有凶险，如有德高望重的大人物出现则会有利，但出外远行、要渡过宽阔的大河则不会顺利。\n《象》曰：天与水违行，讼；君子以作事谋始。\n【白话】《象辞》说《讼卦》的卦象是坎（水）下乾（天）上，为天在水上之表象。天从东向西转动，江河百川之水从西向东流，天与水是逆向相背而行的，象征着人们由于意见不合而打官司。所以君子在做事前要深谋远虑，从开始就要消除可能引起争端的因素。\n\n抽得卦爻：{讼卦}",
"师：贞，丈人吉，无咎。\n【白话】《师卦》象征兵众（师指军队）：坚守正道，德高望重富有经验的长者统帅军队可以得到吉祥，不会有什么灾祸。\n《象》曰：地中有水，师；君子以容民畜众。\n【白话】《象辞》说：《师卦》的卦象是坎（水）下坤（地）上，是地中有水之表象。地中蕴藏聚集了大量的水，取之不尽，用之不竭，象征兵源充足；君子要像地中藏水一样容纳天下百姓，养育众人，这样就会有众多的士兵可用。\n\n抽得卦爻：{师卦}",
"比：吉。原筮，元永贞，无咎。不宁方来，后夫凶。\n【白话】《比卦》象征亲密无间，团结互助：吉祥。探本求原，再一次卜筮占问，知道要辅佐有德行的长者，长久不变地坚守正道，不会有祸害。连不安分的诸侯现在也来朝贺，还有少数来得迟的诸侯将有凶险。\n《象》曰：地上有水，比；先王以建万国，亲诸侯。\n【白话】《象辞》说：《比卦》的卦象为坤，（地）下坎（水）上，象征地上有水。大地上百川争流，流水又浸润着大地，表明地与水亲密无间，互相依存；以前的历代君主明白这个道理，所以分封土地，建立万国，安抚亲近各地诸侯。\n\n抽得卦爻：{比卦}",
"小畜：亨；密云不雨，自我西郊。\n【白话】《小畜卦》象征小有积蓄：亨通顺利；天空布满浓密的积云，但还没有下雨，云气是从城西郊区升起来的。\n《象》曰：风行天上，“小畜”；君子以懿文德。\n【白话】《象辞》说：《小畜卦》的卦象是乾（天）下巽（风）上，是风飘行天上的表象。风在天上吹，密云不雨，气候不好不坏，收成一般，所以只能“小有积蓄”；君子面对这种情况，于是修养美好的品德，用心做好文章等待发达的时机。\n\n抽得卦爻：{小畜}",
"履：履虎尾，不咥人，亨。\n【白话】《履卦》象征小心行动：跟在老虎尾巴后面走路，老虎却没有回头咬人，当然亨通顺利。\n《象》曰：上天下泽，“履”；君子以辩上下，定民志。\n【白话】《象辞》说：《履卦》的卦象是兑（泽）下乾（天）上，为天下有泽之表象。上有天，下有泽，说明要处处小心行动，如行在沼泽之上，一不注意就会陷下去；君子要深明大义，分清上下尊卑名分，坚定百姓的意志，遵循礼仪而行，必然秩序井然。\n\n抽得卦爻：{履卦}",
"泰：小往大来，吉，亨。\n【白话】《泰卦》象征通达：这时弱小者离去，强大者到来，吉祥，亨通。\n《象》曰：天地交，泰；后以财成天地之道，辅相天地之宜，以左右民。\n【白话】《象辞》说：《泰卦》的卦象为乾（天）下坤（地）上，地气上升，乾气下降，为地气居于乾气之上之表象，阴阳二气一升一降，互相交合，顺畅通达；君主这时要掌握时机，善于裁节调理，以成就天地交合之道，促成天地化生万物之机宜，护佑天下百姓，使他们安居乐业。\n初九，拔茅茹，以其汇，征吉。\n\n抽得卦爻：{泰卦}",
"否：否之匪人，不利，君子贞；大往小来。\n【白话】《否卦》象征闭塞：一个卦闭的社会，人们之间的来往是不通畅的，天下没有便利之处，君子必须坚守正道；这时强大者离去，弱小者到来。\n《象》曰：天地不交，“否”；君子以俭德辟难，不可荣以禄。\n【白话】《象辞》说：《否卦》的卦象为坤（地）下乾（天）上，为天在地上之表象。天在极高之处，地在极低之处，天地阴阳之间因而不能互相交合，所以时世闭塞不通，这时候君子必须坚持勤俭节约的美德，以避开危险与灾难不能谋取高官及丰厚的俸禄，去追求荣华富贵。\n\n抽得卦爻：{否卦}",
"同人，同人于野，亨，利涉大川，利君子贞。\n【白话】《同人卦》象征与人和睦相处：和别人亲密地走在宽广的原野上，亨通，有利于渡过大河急流，有利于君子坚守正道。\n《象》曰：天与火，同人；君子以类族辨物。\n【白话】《象辞》说：《同人卦》的卦象是离（为）下乾（天）上，为天下有火之表象。天在高处，火势熊熊而上，天与火亲和相处，君子要明白物以类聚，人以群分的道理，明辨事物，求同存异，团结众人以治理天下。\n\n抽得卦爻：{同人}",
"大有：元亨。\n【白话】《大有卦》象征大有收获：至为亨通。\n《象》曰：火在天上，“大有”；君子以遏恶扬善，顺天休命。\n【白话】《象辞》说：《大有卦》的卦象是乾（天）下离（火）上，为火在天上之表象。火焰高悬于天上，象征太阳照耀万物，世界一片光明，农业大丰收，“大有收获”。君子在这个时候要阻止邪恶，颂扬一切善行，顺应天命，替天行道，以保护万物性命。\n\n抽得卦爻：{大有}",
"谦：亨，君子有终。\n【白话】《谦卦》象征谦虚：谦虚的美德可以使百事顺利，但谦虚并不是人人都能坚持下去的，而只有君子才能坚持到底。\n《象》曰：地中有山，谦。君子以裒多益寡，称物平施。\n【白话】《象辞》说：《谦卦》的卦象是艮（山）下坤（地）上，为高山隐藏于地中之表象，象征高才美德隐藏于心中而不外露，所以称作谦。君子总是损多益少，衡量各种事物，然后取长补短，使其平均。\n\n抽得卦爻：{谦卦}",
"豫：利建侯行师。\n【白话】《豫卦》象征欢乐愉快：有利于建立诸侯的伟大功业，有利于出师南征北战。\n《象》曰：雷出地奋，豫。先王以作乐崇德，殷荐之上帝，以配祖考。\n【白话】《象辞》说：《豫卦》的卦象为坤（地）下震（雷）上，为地上响雷之表象。雷在地上轰鸣，使大地振奋起来，这就是大自然愉快高兴的表现。上古圣明的君主，根据大自然欢乐愉快时雷鸣地震的情景创造了音乐，并用音乐来崇尚推广伟大的功德。他们以盛大隆重的仪礼，把音乐献给天帝，并用它来祭祀自己的祖先。\n\n抽得卦爻：{豫卦}",
"随：元，亨，利，贞，无咎。\n【白话】《随卦》象征随从，随和：如果随从、随和，便能始终亨通，和谐有利。固守正道，没有任何危险。\n《象》曰：泽中有雷，随；君子以向晦入宴息。\n【白话】《象辞》说：《随卦》的卦象是震（雷）下兑（泽）上，为泽中有雷之表象。泽中有雷声，泽随从雷声而震动，这便象征随从。君子行事要遵从合适的作息时间。白天出处辛劳工作，夜晚就回家睡觉安息。\n\n抽得卦爻：{随卦}",
"蛊：元亨，利涉在川；先甲三日，后甲三日。\n【白话】《蛊卦》象征救弊治乱，拨乱反正：从开始就很亨通，有利于涉越大河。不过，在做大事以前，要考察现状、分析事态；在做大事以后，要讲究治理措施，预计到后果。\n《象》曰：山下有风，蛊；君子以振民育德。\n【白话】《象辞》说：《蛊卦》的卦象是巽（风）下艮（山）上，为山下起大风之表象，象征救弊治乱、拨乱反正。这时候，君子救济人民，培育美德，纠正时弊。\n\n抽得卦爻：{蛊卦}",
"临：元，亨，利，贞。至于八月有凶。\n【白话】《临卦》象征督导：能亨通无阻，祥和有益，坚守正道。但是到了八月（阳衰阴盛），会有凶险。\n《象》曰：泽上有地，临；君子以教思无穷，容保民无疆。\n【白话】《象辞》说：《临卦》的卦象是兑（泽）下坤（地）上，为地在泽上之表象。泽上有地，地居高而临下，象征督导。君子由此受到启发，费尽心思地教导人民，并以其无边无际的盛德保护人民。\n\n抽得卦爻：{临卦}",
"观：盥而不荐，有孚顒若。\n【白话】《观卦》象征瞻仰：瞻仰了祭祀开头盛大的倾酒灌地的降神仪式，就可以不去看后面的献饗之礼了，因为这时心中已经充满了诚敬肃穆的情绪。\n《象》曰：风行地上，观；先王以省方观民设教。\n【白话】《象辞》说：《观卦》的卦象是坤（地）下巽（风）上，为风吹拂于地上而遍及万物之表象，象征瞻仰。先代君王仿效风吹拂于地而遍及万物的精神，视察四方，留心民风民俗，用教育来感化民众。\n\n抽得卦爻：{观卦}",
"噬嗑：亨，利用狱。\n【白话】《噬磕卦》象征咬合：亨通无阻，有利于使用刑法。\n《象》曰：雷电，噬磕；先王以明罚赤法。\n【白话】《象辞》说：《噬磕卦》的卦象是震（雷）下离（火）上，为雷电交击之表象。雷电交击，就像咬合一样；雷有威慑力，电能放光明，古代帝王效法这一现象，明其刑法，正其法令。\n\n抽得卦爻：{噬嗑}",
"贲：亨，小利，有攸往。\n【白话】《贲卦》象征装饰：亨通，利于柔小者前去行事。\n《象》曰：山下有火，贲；君子以明庶政，无敢折狱。\n【白话】《象辞》说：《贲卦》的卦象是离（火）下艮（山）上，为山下燃烧着火焰之表象。山下火焰把山上草木万物照得通明，如同披彩，这就叫装饰。君子像火焰一样，使众多的政务清明，但却不能用修饰的方法来断官司。\n\n抽得卦爻：{贲卦}",
"剥：不利有攸往。\n【白话】《剥卦》象征剥落：不利于前去行事。\n《象》曰：山附于地，剥；上以厚下安宅。\n【白话】《象辞》说：《剥卦》的卦象是坤（地）下艮（山）上，好比高山受侵蚀而风化，逐渐接近于地面之表象，因而象征剥落；位居在上的人看到这一现象，应当加强基础，使它更加厚实，只有这样才能巩固其住所而不至发生危险。\n\n抽得卦爻：{剥卦}",
"复：亨。出入无疾，朋来无咎。反复其道，七日来复。利有攸往。\n【白话】《复卦》象征复归：亨通顺利。阳气从下面产生而逐渐向上行进没有阻碍，朋友前来也没有灾难危害。返回复归有一定的运动规律，经过七天就会前来复归。利于前去行事。\n《象》曰：雷在地中，复；先王以至日闭关，商旅不行，后不省方。\n【白话】《象辞》说：《复卦》的卦象是震（雷）下坤（地）上，为雷在地中、阳气微弱地活动之表象，因而象征复归；从前的君主在阳气初生的冬至这一天关闭关口，使商人旅客停止活动，不外出经商、旅行，君主自己也不巡行视察四方。\n\n抽得卦爻：{复卦}",
"无妄：元亨，利贞。其匪正有眚，不利有攸往。\n【白话】《无妄卦》象征不妄动妄求：极为亨通顺利，利于坚守正道。然而，如果不能坚守正道的话就会发生祸殃，因而也就不利于前去行事了。\n《象》曰：天下雷行，物与无妄；先王以茂对时育万物。\n【白话】《象辞》说：《无妄卦》的卦象是震（雷）下乾（天）上，好比在天的下面有雷在运行之表象，象征着天用雷的威势警戒万物，并赋予万物以不妄动妄求的本性；从前的君主顺应天命，尽其所能地遵循天时以养育万物的生长。\n\n抽得卦爻：{无妄}",
"大畜：利贞；不家食吉，利涉大川。\n【白话】《大畜卦》象征大量的畜养积聚：利于坚守正道；不要让贤能的人穷困地居于家中自谋生计，而应该把他招到朝廷中食取国家的俸禄，把才能贡献给国家，这样便可以获得吉祥；利于涉过大河。\n《象》曰：天在山中，大畜；君子以多识前言往行，以畜其德。\n【白话】《象辞》说：《大畜卦》的卦象是乾（天）下艮（山）上，为天被包含在山里之表象，象征大量的畜养积聚；君子效法这一精神，应当努力更多地学习领会前代圣人君子的言论和行为，以此充实自己，培养美好的品德和积聚广博的知识。\n\n抽得卦爻：{大畜}",
"颐：贞吉；观颐，自求口实。\n【白话】《颐卦》象征颐养：只有坚守正道才能获得吉祥；通过观察能够体现颐养的具体实例，以及自己是如何谋取口中食物的，这样才能真正地掌握颐养之道，获得吉祥。\n《象》曰：山下有雷，君子以慎言语，节饮食。\n【白话】《象辞》说：《颐卦》的卦象是震（雷）下艮（山）上，为雷在山下震动之表象，引申为咀嚼食物时上颚静止、下颚活动的状态，因而象征颐养；颐养必须坚守正道，所以君子应当言语谨慎以培养美好的品德，节制饮食以养育健康的身体。\n\n抽得卦爻：{颐卦}",
"大过：栋桡；利有攸往，亨。\n【白话】《大过卦》象征极为过分：房屋的栋梁受重压而弯曲；利于前去行事，亨通顺利。\n《象》曰：泽灭木，大过；君子以独立不惧，遯世无闷。\n【白话】《象辞》说：《大过卦》的卦象是巽（风）下兑（泽）上，巽在这里代表木，故为水泽淹没了树木之表象，象征极为过分；君子取法这一现象，就应当坚持自己的操守，进则超然独行，不必顾忌和畏惧他人的非议；退则逃避世间，不为隐姓埋名而苦闷烦恼。\n\n抽得卦爻：{大过}",
"坎：有孚，维心亨，行有尚。\n【白话】《坎卦》象征重重艰险：像水奔流一样，胸怀坚定的信念，执著专一，内心才能不畏艰险而获得亨通，这种奔流不止、坚强刚毅的行为必然被人们所崇尚。\n《象》曰：水洊至，习坎；君子以常德行，习教事。\n【白话】《象辞》说：《坎卦》的卦象是坎（水）下坎（水）上，为水流之表象。流水相继而至、潮涌而来，必须充满前方无数极深的陷坑才能继续向前，所以象征重重的艰险困难；君子因此应当坚持不懈地努力，反复不间断地推进教育事业。\n\n抽得卦爻：{坎卦}",
"离：利贞，亨；畜牝牛，吉。\n【白话】《离卦》象征附着：利于坚守正道，这样必然亨通；畜养柔顺的母牛，可以获得吉祥。\n《象》曰：明两作，离；大人以继明照于四方。\n【白话】《象辞》说：《离卦》的卦象为离(火)下离(火)上，为光明接连升起之表象。《离卦》的本象为火，这里代表太阳。太阳东升西落，因而有上下充满光明的形象。太阳的光明连续照耀，必须高悬依附在天空才行，所以象征附着；伟大的人物效法这一现象，也应当连绵不断地用太阳般的光明美德普照四方。\n\n抽得卦爻：{离卦}",
"咸：亨，利贞；取女吉。\n【白话】《咸卦》象征感应：亨通顺利，有利于坚守正道；娶妻可以获得吉祥。\n《象》曰：山上有泽，咸；君子以虚受人。\n【白话】《象辞》说：《咸卦》的卦象是艮(山)下兑(泽)上，为山上有泽之表象，即上方的水泽滋润下面的山体，下面的山体承托上方的水泽并吸收其水分的形象，因而象征感应；君子效法山水相连这一现象，以虚怀若谷的精神容纳感化他人。\n\n抽得卦爻：{咸卦}",
"恒：亨，无咎，利贞，利有攸往。\n【白话】《恒卦》象征常久：亨通顺利，没有灾祸，利于坚守正道，利于前去行事。\n《象》曰：雷风，恒；君子以立不易方。\n【白话】《象辞》说：《恒卦》的卦象是巽(风)下震(雷)上，为风雷交加之表象，二者常是相辅相成而不停地活动的形象，因而象征常久；君子效法这一现象，应当树立自身的形象，坚守常久不变的正道。\n\n抽得卦爻：{恒卦}",
"遁：亨，小利贞。\n【白话】《遯卦》象征退避：亨通，小事能够成功。\n《象》曰：天下有山，遯；君子以远小人，不恶而严。\n【白话】《象辞》说：《遁卦》的卦象是艮（山）下乾（天）上，为天下有山之表象，象征着隐让退避。因为山有多高，天就有多高，似乎山在逼天，而天在步步后退，但天无论怎样后退避让，却始终高踞在山之上。君子应同小人保持一定的距离，以傲然不可侵犯的态度截然划清彼此的界限，这样一来，就自然而然会生出一种震慑住小人的威严来。\n\n抽得卦爻：{遁卦}",
"大壮：利贞\n【白话】《大壮卦》象征十分强盛：坚守正道，将会非常有利。\n《象》曰：雷在天上，大壮；君子以非礼弗履。\n【白话】《象辞》说：《大壮卦》的卦象是乾（天）下震（雷）上，为震雷响彻天上之表象，象征着十分强盛。君子应该严格要求自己，不要越出准则和规律去做非分之事。\n\n抽得卦爻：{大壮}",
"晋：康侯用锡马蕃庶，昼日三接。\n【白话】《晋卦》象征长进：就像才干出众的公侯得到了天子的赏识，不仅赐给他许多车马，而且在一天之内多次接见他。\n《象》曰：明出地上，晋；君子以自昭明德。\n【白话】《象辞》说：阳光从地面上升起，象征着前进和昌盛，也象征着发出自己的光和热。所以，君子应该充分显示自己的才华和美德，发挥自己的作用。\n\n抽得卦爻：{晋卦}",
"明夷：利艰贞。\n【白话】《明夷卦》象征光明受阻：在这种情况下，最好是在艰难困苦中坚守正道，保持自身的纯洁和善始善终的恒心。\n《象》曰：明入地中，“明夷”；君子以莅众，用晦而明。\n【白话】《象辞》说：《明夷卦》的卦象是离（火）下坤（地）上，离为火，代表光明，为光明入地下之表象，象征着“光明被阻”。君子要能够遵循这个道理去管理民众，即有意不表露自己的才能和智慧，反而能在不知不觉中使民众得到治理。\n\n抽得卦爻：{明夷}",
"家人：利女贞。\n【白话】《家人卦》象征家庭：特别注重女人在家中的作用，如果她能够坚守正道，始终如一，将会非常有利。\n《象》曰：风自火出，家人；君子以言有物而行有恒。\n【白话】《象辞》说：《家人卦》的卦象是离（火）下巽（风）上，为风从火出之表象，象征着外部的风来自于本身的火，就像家庭的影响和作用都产生于自己内部一样。君子应该特别注意自己的一言一行，说话要有根据和内容，行动要有准则和规矩，不能朝三暮四和半途而废。\n\n抽得卦爻：{家人}",
"睽；小事吉。\n【白话】《睽卦》象征对立；小心谨慎地去行动做事，就能获得吉祥。\n《象》曰：上火下泽，睽；君子以同而异。\n【白话】《象辞》说：《睽卦》的卦象是兑（泽）下离（火）上，为水火相遇之表象，象征对立。所以君子应该在求大同的前提下，保留小的差别和不同。\n\n抽得卦爻：{睽卦}",
"蹇：利西南，不利东北；利见大人，贞吉。\n【白话】蹇卦，象征陷入困境，难以前进；面对这种情况，利于向西南行动，不利于向东北行动。此时利于出现大人物，只要能够坚守正道，始终如一，就一定可以获得吉祥。\n《象》曰：山上有水，蹇；君子以反身修德。\n【白话】《象辞》说：《蹇卦》的卦象是（山）下坎（水）上，为高山上积水之表象，象征艰难险阻，行动困难。面对这种情况，君子应该很好地反省自己，提高自己的品德修养，以通过自身的努力渡过困境。\n\n抽得卦爻：{蹇卦}",
"解：利西南；无所往，其来复吉；有攸往，夙吉。\n【白话】《解卦》象征着灾祸危难的舒解：利于往西南方行事。如果没有什么灾祸，只要严守自己的本分和职责，就一定会吉祥如意的。但是如果发生了祸患，就应该及时地想办法加以解决，这样才能获得吉祥。\n《象》曰：雷雨作，解；君子以赦过宥罪。\n【白话】《象辞》说：《解卦》的卦象是坎（水）下震（雷）上，坎又代表雨；为春雷阵阵，春雨瀟瀟，万物舒展生长之表象，充分显示了解卦所蕴含的解除危难的含义，因此，君子也应该勇于赦免那些有过错的，饶恕那些有罪过的，使他们在宽松的环境下，得到解脱和新生。\n\n抽得卦爻：{解卦}",
"损：有孚，元吉，无咎，可贞，利有攸往。曷之用？二簋可用享。\n【白话】《损卦》象征减损：内心有诚意，最为吉祥，不会招来祸患，可以坚守正道，利于前去行事。用什么祭祀神灵呢？两簋（古代盛食物的器具，圆口，有两个耳子）粗淡的食物就足够了。\n《象》曰：山下有泽，损；君子以惩忿窒欲。\n【白话】《象辞》说：《损卦》的卦象是兑（泽）下艮（山）上，为山下有湖泽之表象，湖泽渐深而高山愈来愈高，象征着减损；按照这一现象中包含的哲理来做人，君子就应该抑制狂怒暴躁的脾性，杜绝世俗的欲望，也就是摒弃格调不高的低级趣味，不断培养高尚的品德。\n\n抽得卦爻：{损卦}",
"益；利有攸往，利涉大川。\n【白话】《益卦》象征增益：利于前去行事，利于渡大河越巨流。\n《象》曰：风雷，益；君子以见善则迁，有过则改。\n【白话】《象辞》说：《益卦》的卦象是震（雷）下巽（风）上，为狂风和惊雷互相激荡，相得益彰之表象，象征“增益”的意思；从中得到的启示就是：君子应当看到良好的行为就马上向它看齐，有了过错就马上改正，不断增强自身的美好品德。\n\n抽得卦爻：{益卦}",
"夬：扬于王庭，孚号有厉；告自邑，不利即戎；利有攸往。\n【白话】《夬卦》象征果决：在君王的宫廷之上当面宣扬小人的罪过，诚心实意地大声疾呼，告诫人们危险依然存在；告诉国人，不利于动用武力；利于马上前去有理有节地解决问题。\n《象》曰：泽上于天，夬；君子以施禄及下，居德则忌。\n【白话】《象辞》说：《夬卦》的卦象是乾（天）下兑（泽）上，为湖水蒸发上天，即将化为雨倾注而下之表象，以此象征决断。君子从中得一启迪：应该自觉地向下层民众广施恩德，否则如果高高在上，不施恩德，就会遭到忌恨。\n\n抽得卦爻：{夬卦}",
"姤：女壮，勿用取女。\n【白话】《姤卦》象征相遇：女子过分强壮，不适合娶来作妻子。\n《象》曰：天下有风，姤；后以施命诰四方。\n【白话】《象辞》说：《姤卦》的卦象是巽（风）下乾（天）上，为天底下刮着风，风吹遍天地间各个角落，与万物相依之表象，象征着“相遇”；正如风吹拂大地的情形一样，君王也应该颁布政令通告四面八方。\n\n抽得卦爻：{姤卦}",
"萃：亨；王假有庙，利见大人，亨利贞，用大牲吉，利有攸往。\n【白话】《萃卦》象征聚合：亨通；君王到宗庙里祭祀，祈求神灵保佑，利于出现德高望重的大人物，亨通无阻而且有利于树立纯正的道德风尚；用牛羊等大的祭品献祭能够带来吉祥如意，利于前去行事。\n《象》曰：泽上于地，萃；君子以除戎器，戎不虞。\n【白话】《象辞》说：《萃卦》的卦象是：坤（地）下兑（泽）上，为地上有湖，四面八方的细流都源源不断汇入湖中之表象，象征着聚合；在这种众流会聚的时候，必然会现鱼龙混杂、泥沙俱下的情况，因此君子应当修缮甲杖兵器，以防发生意想不到的变故。\n\n抽得卦爻：{萃卦}",
"升：元亨，用见大人，勿恤，南征吉。\n【白话】《升卦》象征上升：亨通，宜于出现权高位尊的大人物，用不着忧虑，向南方出征会带来吉祥。\n《象》曰：地中生木，升；君子以顺德，积小以高大。\n【白话】《象辞》说：《升卦》的卦象是巽（风）下坤（地）上，而巽又象征高大树木，这样就成为地里边生长树木之表象。树木由矮小到高大，象征上升；与此相应，君子通过顺应自然规律来培养自己的品德，积累微小的进步来塑造高大完美的人格。\n\n抽得卦爻：{升卦}",
"困：亨；贞，大人吉，无咎；有言不信。\n【白话】《困卦》象征困顿：亨通；占卜结果表明，神通广大的大人物可以获得吉祥，没有灾祸；此时许下的诺言很难令人相信。\n《象》曰：泽无水，困；君子以致命遂志。\n【白话】《象辞》说：《困卦》的卦象是坎（水）下兑（泽）上，为泽中无水之表象，象征困顿；作为君子应该身处穷困而不气馁，为实现自己的志向，不惜牺牲生命。\n\n抽得卦爻：{困卦}",
"井：改邑不改井，无丧无得，往来井井。汔至亦未繘井，羸其瓶，凶。\n【白话】《井卦》：象征无穷：改变迁移城邑不会使水井发生改变和迁徙，井水不会枯竭也不会溢满，来来往往的人都到井里来打水。提水提到井口眼看就要上来了，却把水瓶打翻了，这是凶险的兆头。\n《象》曰：木上有水，井；君子以劳民劝相。\n【白话】《象辞》说：《井卦》的卦象是巽（木）下坎（水）上，即是说水分沿着树身向上运行，直达树冠，为井水源源不断地被汲引到地面之表象，因此象征无穷；井水无穷无尽，孜孜不倦地养育着人们，君子应当效法这种美德，不辞劳苦地为大众谋福利，倡导助人为乐的社会风尚。\n\n抽得卦爻：{井卦}",
"革：己日乃孚，元亨，利贞，悔亡。\n【白话】《革卦》象征变革：在己日变革旧的事物，能够使民众深深的信服，前途通畅，坚守正道，最后就会取得成功，悔恨终将会消释。\n《象》曰：泽中有火，革；君子以治历明时。\n【白话】《象辞》说：《革卦》的卦象是离（火）下兑（泽）上，为泽中有火之表象。大水可以使火熄灭；大火也可以使水蒸发，如此，水火相克相生，从而产生变革。君子根据变革的规律制定历法以明辨春、夏、秋、冬四季的变化。\n\n抽得卦爻：{革卦}",
"鼎：元吉，亨。\n【白话】《鼎卦》象征革故鼎新：十分吉祥，亨通。\n《象》曰：木上有火，鼎，君子以正位凝命。\n【白话】《象辞》说：《鼎卦》的卦象是巽（木）下离（火）上，为木上燃着火之表象，是烹饪的象征，称为鼎；君子应当像鼎那样端正而稳重，以此完成使命。\n\n抽得卦爻：{鼎卦}",
"震：亨。震来虩虩，笑言哑哑；震惊百里，不丧匕鬯。\n【白话】《震卦》象征震动的雷声：可致亨通。当惊雷震动的时候，天下万物都感到恐惧，然而君子却能安之若素，言笑如故；即使雷声震惊百里之遥，主管祭祀的人却能做到从容不迫，手中的匙和酒都未失落。大丈夫威武不能屈，所以能成就大事。\n《象》曰：洊雷，震；君子以恐惧修省。\n【白话】《象辞》说：《震卦》的卦象是震（雷）下震（雷）上，为雷相重叠之表象，好像震动的雷声；君子应悟知恐惧惊惕，修身省过。\n\n抽得卦爻：{震卦}",
"艮：艮其背，不获其身；行其庭，不见其人，无咎。\n【白话】《艮卦》象征抑止：止于背部，不得使身体面向所止的地方；就好像在庭院里行走，两两相背，不曾感觉到有人的存在，进入这一境界，就不会受害。\n《象》曰：兼山，艮；君子以思不出其位。\n【白话】《象辞》说：《艮卦》的卦象是艮（山）下艮（山）上，为两山重叠之表象，象征着抑止；君子的思想应当切合实际，不可超越自己所处的地位。\n\n抽得卦爻：{艮卦}",
"渐：女归吉，利贞。\n【白话】《渐卦》象征循序渐进：如同女子出嫁那样，按照一切婚嫁的礼节循序渐进，就会得到吉祥，有利于坚守正道。\n《象》曰：山上有木，渐；君子以居贤德善俗。\n【白话】《象辞》说：《渐卦》的卦象是艮（山）下巽（风）上，表明高山上的树木逐渐长得高大，象征循序渐进；君子观看高山上的树木逐渐长得高大的情况，由是修养德性，改善社会的风尚、礼节和习惯。\n\n抽得卦爻：{渐卦}",
"归妹：征凶，无攸利。\n【白话】《归妹卦》象征婚嫁：如果行为不正，前方会有凶险，不会有利益。\n《象》曰：泽上有雷，归妹，君子以永终知敝。\n【白话】《象辞》说：《归妹卦》的卦象是兑（泽）下震（雷）上，兑又代表少女，震又代表长男为嫁出少女之表象；君子应当永远使夫妇和谐，白头偕老，防止夫妇关系被破坏。\n\n抽得卦爻：{归妹}",
"丰：亨，王假之；勿忧，宜日中。\n【白话】《丰卦》象征盛大丰满：亨通，君王能够使天下达到盛大丰满；就不用忧愁，好比太阳位居中天，光芒万丈。\n《象》曰：雷电皆至，丰；君子以折狱致刑。\n【白话】《象辞》说：《丰卦》的卦象是离（火）下（震）雷上，离又代表闪电，震为雷，为雷电同时到来之表象，象征着盛大丰满；君子应该像雷电那样，审案用刑正大光明。\n初九，遇其配主，虽旬无咎，往有尚。\n\n抽得卦爻：{丰卦}",
"旅：小亨，旅贞吉。\n【白话】《旅卦》象征旅行：小心谦顺可以亨通，旅行虽是小事，但能坚守正道必然吉祥。\n《象》曰：山上有火，旅；君子以明慎用刑，而不留狱。\n【白话】《象辞》说：《旅卦》的卦象是艮（山）下离（火）上，为火势匆匆蔓延之表象，象征行旅之人匆匆赶路；君子观此应谨慎使用刑罚，明断决狱。\n\n抽得卦爻：{旅卦}",
"巽：小亨，利有攸往，利见大人。\n【白话】《巽卦》象征顺从：谦虚柔顺，小心从事可以达到亨通，这样才能利于所要做的事情，利于出现有道德并居于高位的人物。\n《象》曰：随风，巽；君子以申命行事。\n【白话】《象辞》说：《巽卦》的卦象是巽（风）下巽（风）上，为风行起来无所不入之表象，由此表示顺从。具有贤良公正美德的君主应当仿效风行而物无不顺的样子，下达命令，施行统治。\n\n抽得卦爻：{巽卦}",
"兑：亨，利贞。\n【白话】《兑卦》象征喜悦：亨通畅达，利于坚守中正之道。\n《象》曰：丽泽，兑；君子以朋友讲习。\n【白话】《象辞》说：《兑卦》的卦象是兑（泽）下兑（泽）上，为两个泽水并连之表象。泽水相互流通滋润，彼此受益，因而又象征喜悦；君子应当效法这一精神，乐于同志同道合的朋友一道研讨学业，讲习道义，这是人生最大的乐趣。\n\n抽得卦爻：{兑卦}",
"涣：亨，王假有庙，利涉大川，利贞。\n【白话】《涣卦》象征涣散：顺畅亨通，贤明的君主去祠庙祭祀神灵以祈求保佑，利于渡过大川河流，利于坚守中正之道。\n《象》曰：风行水上，“涣”；先王以享于帝立庙。\n【白话】《象辞》说：《涣卦》的卦象是坎（水）下巽（风）上，为风行水上之表象，象征涣散、离散。先代君王为了收合归拢人心便祭祀天帝，修建庙宇。\n\n抽得卦爻：{涣卦}",
"节：亨，苦节不可，贞。\n【白话】《节卦》象征节制：节制可致亨通；但过分的节制也不可以的，应当持正、适中。\n《象》曰：泽上有水，节；君子以制数度，议德行。\n【白话】《象辞》说：《泽卦》的卦象是兑（泽）下坎（水）上为泽上有水之表象，象征以堤防来节制。水在泽中，一旦满了就溢出来，而堤防本身就是用来节制水的盈虚的。君子应当效法《节卦》的义理，制定典章制度和必要的礼仪法度来作为行事的准则，以此来节制人们的行为。\n\n抽得卦爻：{节卦}",
"中孚：豚鱼吉，利涉大川，利贞。\n【白话】《中孚卦》象征诚信：诚信施及到愚钝无知的小猪小鱼身上，从而感化了它们，因此获得吉祥，利于涉越大河大川，利于坚守中正之道。\n《象》曰：泽上有风，中孚；君子以议狱缓死。\n【白话】《象辞》说《中孚卦》的卦象是兑（泽）下巽（风）上，为泽上有风，风吹动着泽水之表象，比喻没有诚信之德施及不到的地方，说明极为诚信；君子应当效法“中孚”之象，广施信德，慎重地议论刑法讼狱，宽缓死刑。\n\n抽得卦爻：{中孚}",
"小过：亨，利贞；可小事，不可大事，飞鸟遗之音，不宜上，宜下，大吉。\n【白话】《小过卦》象征略为过分：小过之时，可致亨通，但应以正为本，故而利于坚守中正之道；可以去干一些小事，但不可去涉足一些大事；飞鸟留下悲鸣之时，不应该向上强飞，而应该向下栖息，如此，大为吉祥。\n《象》曰：山上有雷，小过；君子以行过乎恭，丧过乎哀，用过乎俭。\n【白话】《象辞》说：《小过卦》的卦象是艮（山）下震（雷）上，为山上响雷之表象，雷声超过了寻常的雷鸣，以此比喻“小有过越”，君子应效法“小过”之象，在一些寻常小事上能略有过分，如行止时过分恭敬，遇到丧事时过分悲哀，日常用度过分节俭，为的是矫枉过正。\n\n抽得卦爻：{小过}",
"既济：亨小，利贞；初吉终乱。\n【白话】《既济卦》象征成功：此时功德完满，连柔小者都亨通顺利，有利于坚守正道；开始时是吉祥的，但如有不慎，终久必导致混乱。\n《象》曰：水在火上，既济；君子以思患而预防之。\n【白话】《象辞》说：《既济卦》的卦象是离（火）下坎（水）上，为水在火上之表象，比喻用火煮食物，食物已熟，象征事情已经成功；君子应有远大的目光，在事情成功之后，就要考虑将来可能出现的种种弊端，防患　于未然，采取预防措施。\n\n抽得卦爻：{既济}",
"未济：亨；小狐汔济，濡其尾，无攸利。\n【白话】《未济卦》象征事未完成：经过努力可以得到亨通；小狐狸渡河快到对岸了，却浸湿了尾巴，则没有什么吉利。\n《象》曰：火在水上，未济；君子以慎辨物居方。\n【白话】《象辞》说：《未济卦》的卦象是坎（水）下离（火）上，为火在水上之表象。火在水上，大火燃烧，水波浩浩，水火相对相克，象征着未完成；君子此时要明辨各种事物，看到事物的本质，努力使事物的变化趋向好的方面，这样做则万事可成。\n\n抽得卦爻：{未济}"],
"乾卦":["初九，潜龙勿用。\n【白话】初九，龙尚潜伏在水中，养精蓄锐，暂时还不能发挥作用。\n《象》曰：潜龙勿用，阳在下也。\n【白话】《象辞》说：龙象征阳。“龙尚潜伏在水中，养精蓄锐，暂时还不能发挥作用”，是因为此爻位置最低，阳气不能散发出来的缘故。",
"九二，见龙在田，利见大人。\n【白话】九二，龙已出现在地上，利于出现德高势隆的大人物。\n《象》曰：“见龙在田”，德施普也。\n【白话】《象辞》说：“龙已出现在地上”，犹如阳光普照，天下人普遍得到恩惠。",
"九三，君子终日乾乾，夕惕若，厉无咎。\n【白话】九三，君子整天自强不息，晚上也不敢有丝毫的懈怠，这样即使遇到危险也会逢凶化吉。\n《象》曰：“终日乾乾”，反复道也。\n【白话】《象辞》说：“整天自强不息”，是因为要避免出现反复，不敢有丝毫大意。",
"九四，或跃在渊，无咎。\n【白话】九四，龙或腾跃而起，或退居于渊，均不会有危害。\n《象》曰：“或跃在渊”，进无咎也。\n【白话】《象辞》说：“龙或腾跃而起，或退居于渊，均不会有危害”，因为能审时度势，故进退自如，不会有危害。",
"九五，飞龙在天，利见大人。\n【白话】九五，龙飞上了高空，利于出现德高势隆的大人物。\n《象》曰：“飞龙在天”，大人造也。\n【白话】《象辞》说：“龙飞上了高空”，象征德高势隆的大人物一定会有所作为。",
"上九，亢龙有悔。\n【白话】上九，龙飞到了过高的地方，必将会后悔。\n《象》曰：“亢龙有悔”，盈不可久也。\n【白话】《象辞》说“龙飞到了过高的地方，必将会后悔”，因为物极必反，事物发展到了尽头，必将走向自己的反面。",
"用九，见群龙无首，吉。\n【白话】用九，出现群龙也不愿意为首的现象，是很吉利的。\n《象》曰：“用九”，天德不可为首也。\n【白话】《象辞》说：“用九”的爻象说明，天虽生万物，但却不居首、不居功。"],
"坤卦":["初六，履霜，坚冰至。\n【白话】初六，脚踏上了霜，气候变冷，冰雪即将到来。\n《象》曰：“履霜坚冰”，阴始凝也；驯致其道，至坚冰也。\n【白话】《象辞》说：“脚踏上了霜，气候变冷，冰雪即将到来”，说明阴气开始凝聚；按照这种情况发展下去，必然迎来冰雪的季节。",
"六二，直方大，不习无不利。\n【白话】六二，正直、端正、广大，具备这样的品质，即使不学习也不会有什么不利。\n《象》曰：六二之动，直以方也，“不习无不利”，地道光也。\n【白话】《象辞》说：六二爻若是出现变化的话，总是表现出正直、端正的性质。“即使不学习也不会有什么不利”，是因为地德广大，包容万物的缘故。",
"六三，含章可贞，或从王事，无成有终。\n【白话】六三，胸怀才华而不显露，如果辅佐君主，能克尽职守，功成不居。\n《象》曰：“含章可贞”，以时发也；“或从王事”，知光大也。\n【白话】《象辞》说：“胸怀才华而不显露”，是要把握时机才发挥，“如果辅佐君主”，必能大显身手，一展抱负。",
"六四，括囊，无咎无誉。\n【白话】六四，扎紧袋口，不说也不动，这样虽得不到称赞，但也免遭祸患。\n《象》曰：“括囊无咎”，慎不害也。\n【白话】《象辞》说：“扎紧袋口，不说也不动，可以免遭祸患”，说明小心谨慎从事，是不会有害的。",
"六五，黄裳，元吉。\n【白话】六五，黄色的衣服，最为吉祥。\n《象》曰：“黄裳元吉”，文在中也。\n【白话】《象辞》说：“黄色的衣服，最为吉祥”，是因为黄色代表中，行事以中道为准则，当然是吉祥的。",
"上六，龙战于野，其血玄黄。\n【白话】上六，阴气盛极，与阳气相战郊外，天地混杂，乾坤莫辨，后果是不堪设想的。\n《象》曰：“龙战于野”，其道穷也。\n【白话】《象辞》说：“阴气盛极，与阳气相战于郊外”，说明阴气已经发展到尽头了。",
"用六，利永贞。\n【白话】“用六”这一爻，利于永远保持中正。\n《象》曰：用六“永贞”，以大终也。\n【白话】《象辞》说：用六的爻辞说“利于永远保持中正”，即是指阴盛到了极点就会向阳转化。"],
"屯卦":["初九，磐桓，利居贞，利建侯。\n【白话】初九，万事开头难，在初创时期困难特别大，难免徘徊不前，但只要能守正不阿，仍然可建功立业。\n《象》曰：虽磐桓，志行正也。以贵下贱，大得民也。\n【白话】《象辞》说：虽然徘徊不前，但志向和行为纯正。只要能下定决心，深入基层，仍然会大得民心的。",
"六二，屯如邅如，乘马班如。匪寇婚媾，女子贞不字，十年乃字。奇_-_書*-*网-QＩＳuu.ｃＯm\n【白话】六二，为难而团团转，乘马旋转不进，不是盗寇，是来求婚的。女子贞静自守，不嫁人，要过十年才许嫁。\n《象》曰：六二之难，乘刚也。“十年乃字”，反常也。\n【白话】《象辞》说：六二爻之所以出现困难，是由于阳刚一方所造成的。“十年才许嫁”，是很反常的现象。",
"六三，即鹿无虞，惟入于林中，君子几，不如舍，往吝。\n【白话】六三，追逐鹿时，由于缺少管山林之人的引导，致使鹿逃入树林中去。君子此时如仍不愿舍弃，轻率地继续追踪，则必然会发生祸事。\n《象》曰：“即鹿无虞”，以从禽也。君子舍之，往吝穷也。\n【白话】《象辞》说：“追逐鹿缺少管山林之人引导”，是因为获鹿之心过于急切。君子应及时放弃，否则必有祸事或导致穷困。",
"六四，乘马班如，求婚媾，往吉，无不利。\n【白话】六四，四马前进，步调不一，但如坚定不移地去求婚，则结果必然是吉祥顺利的。\n《象》曰：求而往，明也。\n【白话】《象辞》说：坚定不移地去追求，是明智之举。",
"九五，屯其膏，小贞吉，大贞凶。\n【白话】九五，只顾自己囤积财富而不注意帮助别人，是很危险的，那样做，办小事虽有成功的可能，但办大事则必然会出现凶险。\n《象》曰：“屯其膏”，施未光也。\n【白话】《象辞》说：“只顾自己囤积财富而不注意帮助别人”，这样的人即使想有所作为，其前景也不大光明。",
"上六，乘马班如，泣血涟如。\n【白话】上六，四马前进，步调不一，进退两难，悲伤哭泣，泣血不止。\n《象》曰：“泣血涟如”，何可长也？\n【白话】《象辞》说：“悲伤哭泣，泣血不止”，这种状况怎能维持长久呢？"],
"蒙卦":["初六，发蒙，利用刑人，用说桎梏；以往吝。\n【白话】初六，要进行启蒙教育，贵在树立典型，以便防止罪恶发生；如不专心求学，而是急功冒进，将来必然会后悔。\n《象》曰：利用刑人，以正法也。\n【白话】《象辞》说：用树立典型的办法来进行启蒙教育，是为了确立正确的法度，以便遵循。",
"九二，包蒙，吉。纳妇，吉；子克家。\n【白话】九二，周围都是上进心很强的蒙童，希望获得知识，这是很吉利的。如果迎娶新媳妇，也是吉祥的。由于渴望接受教育，上进心很强，所以连孩子们已经能够治家了。\n《象》曰：“子克家”，刚柔接也。\n【白话】《象辞》说：“由于渴望接受教育，上进心很强，所以连孩子们都已经能够治家了”，这是因为刚柔相济，孩子们受到了很好的启蒙教育的结果。",
"六三，勿用取女，见金夫，不有躬，无攸利。\n【白话】六三，不能娶这样的女子，她的心目中只有美貌的郎君，不能守礼仪，也难以保住自己的节操，娶这样的女子是没有什么好处的。\n《象》曰：“勿用取女”，行不顺也。\n【白话】《象辞》说：“不能娶这个女子”，主要是指这个女子的行为是不合乎礼仪的，即这个女子没有受过良好的启蒙教育。",
"六四，困蒙，吝。\n【白话】六四，人处于困难的境地，不利于接受启蒙教育，因而孤陋寡闻，结果是不大好的。\n《象》曰：“困蒙之吝”，独远实也。\n【白话】《象辞》说：“人处于困难的境地，不利于接受启蒙教育”，是因为疏远有真才实学的老师。",
"六五，童蒙，吉。\n【白话】六五，蒙童虚心地向老师求教，这是很吉祥的。\n《象》曰：“童蒙之吉”，顺以巽也。\n【白话】《象辞》说：“蒙童虚心地向老师求教，这是很吉祥的”，这是因为蒙童对老师采取了谦逊的态度。蒙童谦逊，则老师乐教，其教育结果自然是比较有效的，当然也是吉祥的。",
"上九，击蒙，不利为寇，利御寇。\n【白话】上九，启蒙教育要及早实行，要针对蒙童的缺点，先发治人。不要等到蒙童的问题彻底暴露再去教育，而要防患于未然，事先进行启蒙教育。\n《象》曰：“利用御寇”，上下顺也。\n【白话】《象辞》说：“启蒙教育要及早实行，要针对蒙童的缺点，先发治人”，因为只有这样，才能使老师和蒙童互相配合，才能达到治病救人、上下一心的目的。"],
"需卦":["初九，需于郊，利用恒，无咎。\n【白话】初九，在郊外等待，必须有恒心，长久耐心地静候时机，不会有什么祸患。\n《象》曰：“需于郊”，不犯难行也；“利用恒，无咎”，未失常也。\n【白话】《象辞》说：“在郊外等待”，表明不能冒险轻率前行；“长久耐心地等候时机，不会有什么祸患”，表明没有偏离正道，没有偏离天地恒常之理。",
"九二，需于沙，小有言，终吉。\n【白话】九二，在沙滩上等待，虽然要受到别人的一些非难指责，耐心等待终究会获得吉祥。\n《象》曰：“需于沙”，衍在中也；虽有小言，以终吉也。\n【白话】《象辞》说：“在沙滩上等待”，表明宽宏大量不急躁；虽然受到一些非难和指责，但终久能获得吉祥。",
"九三，需于泥，致寇至。\n【白话】九三，在泥泞中等待，结果抢劫的强徒乘机而至。\n《象》曰：“需于泥”，灾在外也；自我致寇，敬慎不败也。\n【白话】《象辞》说：“在泥泞中等待”，说明灾祸还在外面，尚未殃及本身；自己招引来强盗，说明要处处谨慎小心才能避开危险。\n",
"六四，需于血，出自穴。\n【白话】六四，在血泊中等待，不小心陷进深穴，用尽全力才逃脱出来。\n《象》曰：“需于血”，顺以听也。\n【白话】《象辞》说：“在血泊中等待”，表明此时必须沉着冷静，顺应时势，听天由命，以等待转机。",
"九五，需于酒食，贞吉。\n【白话】九五，准备好酒食招待客人，占问的结果是吉祥的。\n《象》曰：“酒食贞吉”，以中正也。\n【白话】《象辞》说：“准备好酒食招待客人，占问的结果是吉祥的”，说明此时处于中位，完美无缺。",
"上六，入于穴，有不速之客三人来；敬之，终吉。\n【白话】上六，落入了洞穴之中，忽然有不请自来的三位客人到来；对他们恭恭敬敬，以礼相待，终久会得到吉祥的结果。\n《象》曰：“不速之客来，敬之终吉”。虽不当位，未大失也。\n【白话】《象辞》说：“不请自来的三位客人到来，对他们恭敬而且热情地招待，终久获得吉祥”，表明此时尽管处在不适当的地位，但还没有遭受大的损失"],
"讼卦":["初六，不永所事；小有言，终吉。\n【白话】初六，不久将陷于争端之中；虽然会受到一些非难和指责，但终久将获得吉祥。\n《象》曰：“不永所事”，讼不可长也；虽“小有言”，其辩明也。\n【白话】《象辞》说：“不久陷于争端之中”，说明与人争端决不可长久，决不可互不让步，相持不下；虽然“受到一些非难指责”，但通过摆事实讲道理，可以明辨事非。",
"九二，不克讼，归而逋，其邑人三百户，无眚。\n【白话】九二，打官司失利，走为上策，赶快逃回来，跑到只有三百户人家的小国中，在此居住可以避开灾祸。\n《象》曰：“不克讼，归逋窜也”；自下讼上，患至掇也。\n【白话】《象辞》说：“打官司失利，迅速逃回来”，因为自己处于下位，与上面有权有势的人打官司，必然要失败而且有灾祸降临，但逃走避开，灾祸就没有了。",
"六三，食旧德，贞厉，终吉；或从王事，无成。\n【白话】六三，安享着原有的家业，吃喝不愁，坚守正道，处处小心防备危险，终久会获得吉祥；如果辅佐君王建功立业，成功后不归功于自己。\n《象》曰“食旧德”，从上吉也。\n【白话】《象辞》说：“安享着祖上遗留下来的家业”，说明只要顺从上级，则可以获得吉祥的结果。",
"九四，不克讼；复即命，渝，安贞吉。\n【白话】九四，打官司失利，经过反思改变了主意，决定不打官司了，安分守己，必然会得到吉利的结果。\n《象》曰：“复即命，渝”，安贞不失也。\n【白话】《象辞》说：“打官司失利后，回过头仔细反思，觉得‘和为贵’，还是息事宁人为好，于是改变了主意，撤回诉状，退出争端不打官司了”，说明坚守正道，安分守己就没有什么损失了。",
"九五，讼，元吉。\n【白话】九五，官司得到了公正的判决，开始获得吉祥。\n《象》曰：“讼，元吉”，以中正也。\n【白话】《象辞》说：“官司得到公正的判决，开始获得吉祥”，表明此时居于正中地位，得到了大人物的公正的判处。",
"上九，或锡之鞶带，终朝三褫之。\n【白话】上九，因打官司获胜，君王偶然赏赐给饰有皮束衣带的华贵衣服，但在一天之内却几次被剥下身来。\n《象》曰：以讼受服，亦不足敬也。\n【白话】《象辞》说：因为打官司获胜而得到赏赐，没有什么可以值得尊敬的。"],
"师卦":["初六，师出以律，否臧凶。\n【白话】初六，出师征战必须要有严明的纪律，如果军纪混乱必然有凶险。\n《象》曰：“师出以律”，失律凶也。\n【白话】《象辞》说：“出师征战必须要有严明的纪律”，要号令整齐，行动一致，赏罚分明。如果军纪不良，指挥不灵，必然要发生凶险。",
"九二，在师，中吉，无咎；王三锡命。\n【白话】九二，在军中任统帅，持中不偏可得吉祥，不会有什么灾祸；君王多次进行奖励，并被委以重任。\n《象》曰：“在师中吉”，承天宠也；“王三锡命”，怀万邦也。\n【白话】《象辞》说：“在军中任统帅，持中不偏可得吉祥，不会有什么灾祸”，表明承受‘天命’，因此得到君王的宠幸；“君王多次进行奖励”，说明怀有治国平天下使万邦悦服的弘大志向。",
"六三，师或舆尸，凶。\n【白话】六三，不时有士兵从战场上运送战死者的尸体回来，凶险。\n《象》曰：“师或舆尸”，大无功也。\n【白话】《象辞》说：“士兵不时运送战死者的尸体回来”，说明不能知己知彼，在敌强我弱的情况下，不自量力发动进攻，结果战败，没有任何功绩可言了。",
"六四，师左次，无咎。\n【白话】六四，率军暂时撤退，免得遭受损失。\n《象》曰：“左次无咎”，示失常也。\n【白话】《象辞》说“观察了战场形势后，暂时后退以避敌精锐，免遭更大损失”。说明深通兵法，懂得用兵有进有退的常理。",
"六五，田有禽，利执言，无咎；长子帅师，弟子舆尸，贞凶。\n【白话】六五，田野中有野兽出没，率军围猎捕获，不会有损失；委任德高望重的长者为军中主帅，必将战无不胜，委任无德小人将运送着尸体大败回，占问的结果必然是凶险的。\n《象》曰：“长子帅师”，以中行也；“弟子舆尸”，使不当也。\n【白话】《象辞》说：“委任有德长者统帅军队战无不胜”，表明居中恃正，行为有法度，必然获胜；“委任无德小人将运送着战死者的尸体，大败而归”，说明用人不当，必招致大败，将自食恶果。",
"上六，大君有命，开国承家，小人勿用。\n【白话】上六，凯旋而归，天子颁布了诏命，分封功臣，或封为诸侯，或封为上卿，或封为大夫，但小人决不可以重用。\n《象》曰：“大君有命”，以正功也；“小人勿用”，必乱邦也。\n【白话】《象辞》说：“天子颁布了诏命，分封功臣”，是为了按功劳大小而公正封赏。“小人决不可以重用”，因为重用小人必然危害并扰乱邦国。"],
"比卦":["初六，有孚比之，无咎；有孚盈缶，终来有它，吉。\n【白话】初六，具有诚实守信的德行，亲密团结，辅佐君主，不会有灾祸；诚信的德行如同美酒注满了酒缸，这样远方的人纷纷前来归附，结果是吉祥的。\n《象》曰：《比》之初六，有它吉也。\n【白话】《象辞》说：《比卦》的第一爻位（初六），表示一开始便具有诚信的德行，致使远方来人归附，自然可获吉祥。",
"六二，比之自内，贞吉。\n【白话】六二，在内部亲密团结，努力辅佐君主，结果是吉祥的。\n《象》曰：“比之自内”，不自失也。\n【白话】《象辞》说：“内部亲密无间团结一致，辅佐君主”，说明没有偏离了正道。",
"六三，比之匪人。\n【白话】六三，和行为不端正的人交朋友，而且关系亲密。\n《象》曰“比之匪人”，不亦伤乎？\n【白话】《象辞》说：“和行为不端正的人交朋友，而且关系亲密”，难道不是一件很可悲的事吗？",
"六四，外比之，贞吉。\n【白话】六四，在对外交往中互相信任，亲密团结，尽力辅佐贤明的君主，其结果是吉祥的。\n《象》曰：外比于贤，以从上也。\n【白话】《象辞》说：在外面亲密团结朋友，辅佐贤君，说明要顺从居于尊上地位的君主，才会有好的结果。\n",
"九五，显比；王用三驱，失前禽，邑人不诫，吉。\n【白话】九五，光明无私，亲密团结，互相辅助；跟随君王去田野围猎，从三面驱赶，网开一面，看着禽兽从放开的一面逃走，毫不在乎，君王的部下也不戒备，吉祥。\n《象》曰：“显比”之吉，位正中也，舍逆取顺，失前禽也；邑人不诫，上使中也。\n【白话】《象辞》说：“光明无私，亲密团结，互相辅助”，可获得吉祥，因为此时居于正中位置。抛弃逆天行事的举动而顺其自然，就好像围猎时网开一面，让该被擒的禽兽落网，不该被获的从前面逃掉；君王的部下听其自然，不加戒备；这是君王的贤德感化了部下的缘故。",
"上六，比之无首，凶。\n【白话】上六，和众人亲密团结、互助友爱但自己不居于领导地位，将有凶险。\n《象》曰：“比之无首”，无所终也。\n【白话】《象辞》说：“和众人亲密团结、互助友爱但自己不居于领导地位，将有凶险”，说明自己将来没有可以归附的地方，无立足之地。"],
"小畜":["初九，复自道，何其咎？吉。\n【白话】初九，自己从原路返回，哪里会有什么灾害呢？吉祥。\n《象》曰：“复自道”，其义吉也。\n【白话】《象辞》说：“自己从原路返回”，表明这行动很适宜，符合常理，因而吉祥。",
"九二，牵复，吉。\n【白话】九二，带着别人一道从原路返回，吉祥。\n《象》曰：牵复在中，亦不自失也。\n【白话】《象辞》说：带着别人从原路返回，表明此时处于居中位置，自己不会失掉阳刚的德行。",
"九三，舆说辐，夫妻反目。\n【白话】九三，行在半路上，忽然大车的辐条从车轮中脱出来，车不能再行了，回到家里，夫妻因此大吵大闹着要离婚。\n《象》曰：夫妻反目，不能正室也。\n【白话】《象辞》说：结发夫妻吵闹着要离婚，说明丈夫不能以家规要求妻子，自己也没有给妻子做出表率，所以妻子不守妇道。",
"六四，有孚；血去惕出，无咎。\n【白话】六四，具有诚实守信的德行，互相信任；抛弃忧患意识与戒备心理，这样就没有灾祸。\n《象》曰：“有孚惕出”，上合志也。\n【白话】《象辞》说：“具有诚信之德并抛弃戒备心理”表明这样符合居于尊上地位的权势者的意愿。",
"九五，有孚挛如，富以其邻。\n【白话】九五，具有诚信的德行，与别人紧密联系并互相帮助，自己致富也要使邻人跟着一同富起来。\n《象》曰：“有孚挛如”，不独富也。\n【白话】《象辞》说：“具有诚信的德行与别人紧密联系并互相帮助”，表明要与人共同富裕，不独自享受富贵。",
"上九，既雨既处，尚德载；妇贞厉，月几望；君子征凶。\n【白话】上九，下起了细雨，但不久又停下来，阳刚者的德行被阴气所弥漫掩盖；这时妇人要坚守正道，因为十五月圆十六就开始亏了，要小心防备危险。君子要出外远行，必有凶险。\n《象》曰：“既雨既处”，德积载也；“君子征凶”，有所疑也。\n【白话】《象辞》说：“下起了细雨，但不久又停下来”，表明这时阴气弥漫掩盖了阳刚之德；“君子外出远行必遭凶险”，说明阴湿之气聚集，到处一片茫茫，方向不清，情况不明，自然会发生危险。"],
"履卦":["初九，素履，往无咎。\n【白话】初九，心地纯朴，品行端正，处处小心行事，那么无论到什么地方都没有灾祸。\n《象》曰：“素履之往”，独行愿也。\n【白话】《象辞》说：“心地纯朴，品行端正，处处小心行事”，表明要专心致志，遵循礼仪实现自己的意愿。",
"九二，履道坦坦，幽人贞吉。\n【白话】九二，小心行走在平坦宽广的大道上,幽居的人安于闲逸恬静的生活，结果是吉祥的。\n《象》曰：“幽人贞吉”，中不自乱也。\n【白话】《象辞》说：“幽居的人可获吉祥”，说明自己内心平静自然毫不紊乱，循礼仪而行的信念坚固。",
"六三，眇能视，跛能履。履虎尾咥人，凶；武人为于大君。\n【白话】六三，眼睛快要瞎了，但勉强能看到一点点；腿跛了，但勉强能走几步。不小心踩在老虎尾巴上，老虎回头就咬人，凶险；勇敢的武士要竭力为君主效劳。\n《象》曰：“眇能视”，不足以有明也；“跛能履”，不足以与行也；“咥人之凶”，位不当也；“武人为于大君”，志刚也。\n【白话】《象辞》说：“眼睛快瞎了，但勉强能看到一点点”，不足以分辩事物；“腿跛了，但勉强能走几步”，不能出外远行；“老虎咬人是凶险的”，表明这时处的位置很不妥当，竟然踩在老虎尾巴上。“武士要竭力为君主效劳”，表明武士的志向刚强。",
"九四，履虎尾，愬愬，终吉。\n【白话】九四，跟在老虎尾巴后面走路，感到恐惧害怕，但谨慎小心，终于得到吉祥。\n《象》曰：“愬愬终吉”，志行也。\n【白话】《象辞》说：“感到恐惧害怕，但谨慎小心，终久获得吉祥”，说明小心遵循礼仪而行就能实现自己的志愿。\n",
"九五，夬履，贞厉。\n【白话】九五，刚毅善于作出决断，小心行动，要提防危险。\n《象》曰：“夬履贞厉”，位正当也。\n【白话】《象辞》说：“刚毅果断，小心行动，要提防危险”，说明此时虽处于正当的位置，但也不能疏忽大意。",
"上九，视履考祥，其旋元吉。\n【白话】上九，回头看看走过的路，详细察看一下吉凶祸福，转身来顺应阴柔自然之道，这样是吉祥的。\n《象》曰：元吉在上，大有庆也。\n【白话】《象辞》说：极为吉祥，高居尊上之位，表明有大的福分值得庆祝。"],
"泰卦":["初九，拔茅茹，以其汇，征吉。\n【白话】初九，拔起了一把茅草，它们的根相连在一起，真是物以类聚，所以找它时要以其种类而识别，往前行进是吉祥的。\n《象》曰：拔茅征吉，志在外也。\n【白话】《象辞》说：拔起一把茅草，往前行进可获吉祥，说明有远大的志向，有在外建功立业的进取心。",
"九二，包荒，用冯河，不遐遗；朋亡，得尚于中行。\n【白话】九二，有包容大川似的宽广胸怀，可以徒步涉过大河急流；礼贤下士，对远方的贤德之人也不遗弃；不结成小团体，不结党营私，能够辅佐公正有道德的君主。\n《象》曰：“包荒”，“得尚于中行”，以光在也。\n【白话】《象辞》说：“有包容大川似的宽广胸怀”，“能够辅佐公正有道德的君主”，说明自己光明正大，道德高尚。",
"九三，无平不陂，无往不复；艰贞无咎，勿悔恤其孚，于食有福。\n【白话】九三，没有平地不变为陡坡的，没有只出去不回来的，处在艰难困苦的环境中坚守正道就没有灾害，不要怕不能取信于人，安心享用自己的俸禄是很有福分的。\n《象》曰：“无往不复”，天地际也。\n【白话】《象辞》说：“没有只出去而不回来的”，叶落归根，人回故乡，事物的正反两个方面往往互相转化，表明此时正在天地交合的边沿，处于变化之中。",
"六四，翩翩不富，以其邻不戒以孚。\n【白话】六四，像飞鸟连翩下降，虚怀若谷，这样与邻居相处，不互相戒备，彼此以诚相见，讲求信用。\n《象》曰：“翩翩不富”，皆失实也；“不戒以孚”，中心愿也。\n【白话】《象辞》说：“像飞鸟从高处连翩下降，虚怀若谷”，说明此时不以个人的殷实富贵为念；“与邻居相处，不互相戒备，彼此以诚相见，讲求信用”，因为这是大家内心共同的意愿。",
"六五，帝乙归妹，以祉元吉。\n【白话】六五，商代帝王乙嫁出自己的女儿，因此得到了福分，是十分吉祥的事。\n《象》曰：“以祉元吉”，中以行愿也。\n【白话】《象辞》说：“帝乙把女儿嫁给贤德而又富裕的人家，因此获得了深厚的福分，是在吉在利的事”，说明因为实现了长期以来心中祈求的意愿，所以结果是吉祥的。",
"上六，“城复于隍”；勿用师，自邑告命，贞吝。\n【白话】上六，城墙倒塌在久已干涸的护城壕沟里；这时决不可进行战争，应减少繁琐的政令，以防止可能出现的土崩瓦解的局面。\n《象》曰：城复于隍，其命乱也。\n【白话】《象辞》说：“城墙倒塌在久已干涸的护城壕沟里”，说明形势已经向错乱不利的方面转化，其前景是不大美妙的。"],
"否卦":["初六，拔茅茹，以其汇，贞吉，亨。\n【白话】初六，拔起一把茅草，只见它们的根连在一起，物以类聚，找它们时要以其种类来识别；结果是吉祥的，亨通。\n《象》曰：“拔茅贞吉”，志在君也。\n【白话】《象辞》说：“拔起茅草，其根相连，结果吉祥”，说明忠心耿耿，有为君主建功立业的远大志向。",
"六二，包承，小人吉；大人否，亨。\n【白话】六二，阿谀奉承有权势的人，小人因此获得吉祥；德高望重的大人物否定了阿谀奉承，则是吉利的。\n《象》曰：“大人否享”，不乱群也。\n【白话】《象辞》说：“德高望重的大人物否定了阿谀奉承，则是吉利的”，因为德高望重的大人物是不能与小人为伍的。",
"六三，包羞。\n【白话】六三，由于受纵容而胡作非为，终于召致羞辱。\n《象》曰：“包羞”，位不当也。\n【白话】《象辞》说：“由于受纵容而胡作非为，终于召致羞辱”，说明此时处的位置不正。",
"九四，有命无咎，畴离祉。\n【白话】九四，奉行天命，替天行道，开通闭塞，没有灾祸，大家互相依附都可以获得福分。\n《象》曰：“有命无咎”，志行也。\n【白话】《象辞》说：“奉行天命，替天行道，开通闭塞没有灾祸”，说明要实现济困扶危替天行道的志向。",
"九五，休否，大人吉；其亡其亡，系于苞桑。\n【白话】九五，时世闭塞不通的局面将要停止，德高势隆的大人物可以获得吉祥；居安思危，常常以“不久将要灭亡，不久将要灭亡”，这样的警句来提醒自己，才能像系结在一大片丛生的桑树上那样牢固，安然无事。\n《象》曰：“大人之吉”，位正当也。\n【白话】《象辞》说：“德高势隆的大人物可以获得吉祥”，说明此时处于居中位置，合适得当。"],
"同人":["初九，同人于门，无咎。\n【白话】初九，一出门便能与人和睦相处，不会有什么灾祸。\n《象》曰：出门同人，又谁咎也！\n【白话】《象辞》说：一出门便能与人和睦相处，又有谁会来危害你呢？\n",
"六二，同人于宗，吝。\n【白话】六二，只和本宗本派的人和睦相处，必然会惹来一些麻烦。\n《象》曰：“同人于宗”，吝道也。\n【白话】《象辞》说“只和本宗本派的人和睦相处”，不能团结各个阶层的人，这是引起麻烦的根源。\n",
"九三，伏戎于莽，升其高陵，三岁不兴。\n【白话】九三，把军队埋伏在密林草莽之中，占据附近的制高点频频瞭望，三年都不敢出兵打仗。\n《象》曰：“伏戎于莽”，敌刚也；“三岁不兴”，安行也？\n【白话】《象辞》说：“埋伏军队在密林草莽中”，说明敌人力量强大，我方力量弱小，只能潜伏下来。“三年都不敢兴兵打仗”，表明敌我力量相差悬殊，怎么敢冒险轻进呢？",
"上九，倾否；先否后喜。\n【白话】上九，时世闭塞不通的局面将要改变，发生了天翻地覆的变化；起初闭塞不通，后来顺畅通达，大家欢喜高兴。\n《象》曰：否终则倾，何可长也！\n【白话】《象辞》说：闭塞到了极点必然要发生倾覆，物极必反，否极泰来，一种局面不会长久持续不发生变化的！",
"九四，乘其墉，弗克攻，吉。\n【白话】九四，准备登城向敌人进攻，但终于没有进攻，是吉祥的。\n《象》曰：“乘其墉”，义弗克也，其“吉”，则困而反则也。\n【白话】《象辞》说：“准备登城向敌人进攻”，但终于没有进攻，是因为发现这种进攻是不仁义的，这样做能获得吉祥，是因为在困惑时能及时醒悟，反过来能按正确的办法行事。",
"九五，同人，先号咷，而后笑，大师克相遇。\n【白话】九五，与人和睦相处，开始大声痛哭，后来破涕为笑，大军作战告捷，志同道合者相会在一起。\n《象》曰：同人之先，以中直也；大师相遇，天罔极上遇，言相克也。\n【白话】《象辞》说：与人和睦相处，开始大声痛哭，说明这时内心中正诚信，因不知战事的胜败而焦急痛哭；大军遇到了志同道合者，终于获得了战争的胜利，于是欢笑起来。",
"上九，同人于郊，无悔。\n【白话】上九，在荒郊也愿与人和睦相处，未遇到志同道合者，也不后悔。\n《象》曰：“同人于郊”，志未得也。\n【白话】《象辞》说：“在荒郊也愿与人和睦相处，未遇到志同道合者”，说明此时团结众人，而希望天下大同的愿望没有实现。"],
"大有":["初九，无交害，匪咎；艰则无咎。\n【白话】初九，不互相来往，也不彼此伤害，没有什么祸患；要牢记过去的艰难困苦，才能免于引起祸患。\n《象》曰：大有初九，无交害也。\n【白话】《象辞》说：《大有卦》的第一爻（初九），说明此时不互相往来，一动不如一静，就不会有什么事非，自然没有什么祸患了。",
"九二，大车以载，有攸往，无咎。\n【白话】九二，用大车装载着财物，送到前面的地方，必然没有什么祸患。\n《象》曰：“大车以载”，积中不败也。\n【白话】《象辞》说：“用大车装载着财物”，说明很富有，只要把财物放于车中，无论怎样颠簸震荡，都不会倾覆。",
"九三，公用亨于天子，小人弗克。\n【白话】九三，王公前来朝贺，向天子贡献礼品并致以敬意，小人不能担任如此重要的职务。\n《象》曰：“公用亨于天子”，小人害也。\n【白话】《象辞》说：“王公前来朝贺，向天子贡献礼品并致以敬意”，小人若担任如此重要的职务，必然发生变乱，成为祸害。",
"九四，匪其彭，无咎。\n【白话】九四，虽然家财万贯，但不过分聚敛财物，就不会发生灾祸。\n《象》是：“匪其彭，无咎”，明辨晢也。\n【白话】《象辞》说：“虽然家财万贯，但不过分聚敛财物，就不会发生灾祸”，说明眼光远大，智慧过人能明辨事非，懂得凡事不能做过头的哲理。",
"六五，厥孚交加，威如，吉。\n【白话】六五，以诚实守信的准则对外交往，对上尊敬，对下怀柔，必然增加个人的威信，是吉祥的。\n《象》曰：“厥孚交加”，信以发志也；“威如之吉”，易而无备也。\n【白话】《象辞》说：“以诚实守信的准则对外交往，对上尊敬，对下怀柔”，说明以自己的诚实信用感动别人，使别人也变得诚实守信起来；“必然增加个人的威信，是吉祥的”，说明平易近人，纯真简朴，无所防备，反而使人人敬畏。",
"上九，自天佑之，吉无不利。\n【白话】上九，上天保佑有德之人，赐福于己，吉祥，无往不利。\n《象》曰：《大有》上吉，自天佑也。\n【白话】《象辞》说：《大有卦》第六爻位（上九）的吉祥，是上天保佑有道德的人，是上天赐给的福分，只有顺天应人，才能大有收获，得到大量的财富。"],
"谦卦":["初六，谦谦君子，用涉大川，吉。\n【白话】初六，谦虚而又谦虚的君子，可以涉过大河（意思是能够克服一切困难，排除一切障碍），最终必然安全吉祥。\n《象》曰：“谦谦君子”，卑以自牧也。\n【白话】《象辞》说：“谦虚而又谦虚的君子”，即使处于卑微的地位，也能以谦虚的态度自我约束；而不因为位卑，就在品德方面放松修养。",
"六二，鸣谦，贞吉。\n【白话】六二，谦虚的美名远扬四方，固守中正就可获得吉祥。\n《象》曰：“鸣谦，贞吉”，中心得也。\n【白话】《象辞》说：“谦虚的美名远扬四方，固守中正就可获得吉祥”，这是说六二爻以心中纯正羸得名声，而不是靠沽名钓誉获取名声。",
"九三，劳谦君子，有终，吉。\n【白话】九三，勤劳而谦虚的君子，必能把美德保持到底，最终一定是吉祥的。\n《象》曰：“劳谦君子”，万民服也。\n【白话】《象辞》说：“勤劳而又谦虚的君子，必能把美德保持到底”，所以天下的老百姓都服从他。",
"六四，无不利，挥谦。\n【白话】六四，没有任何不吉利，要发扬光大谦虚的美德。\n《象》曰：“无不利，挥谦”，不违则也。\n【白话】《象辞》说：“没有任何不吉利，要发扬光大谦虚的美德”这不违背谦虚导致亨通的原则。",
"六五，不富，以其邻利用侵伐，无不利。\n【白话】六五，虽不富有，但却虚怀若谷，有利于和近邻一起征伐那些骄傲蛮横不可一世的人，不会有任何不吉利的结果。\n《象》曰：“利用侵伐”，征不服也。\n【白话】《象辞》说：“有利于出兵讨伐”，是指征伐那些骄横而不可一世的人。",
"上六，鸣谦，利用行师，征邑国。\n【白话】上六，谦虚的美德远扬四方，有利于征伐邻近的小国。\n《象》曰：“鸣谦”，志未得也；“可用行师”，征邑国也。\n【白话】《象辞》说：“谦虚的美名远扬四方”，但安邦定国之志未酬，所以“可用出师征讨”的办法来惩处那些骄横不可一世的小国。"],
"豫卦":["初六，鸣豫，凶。\n【白话】初六，自鸣得意，高兴过了头，结果乐极生悲，必遭凶险。\n《象》曰：初六，“鸣豫”，志穷凶也。\n【白话】《象辞》说：《豫卦》的第一位（初六），“自鸣得意，高兴过了头”，说明它没有雄心壮志，志向容易满足。一满足，就得意忘形，结果必遭凶险。",
"六二，介于石，不终日，贞吉。\n【白话】六二，正直而不同流合污的品德坚如磐石，还不到一天时间，就明白了欢乐愉快的深刻道理，能守正必获吉祥。\n《象》曰：“不终日，贞吉”，以中正也。\n【白话】《象辞》说：“还不到一天时间，就明白了愉快欢乐的深刻道理，能守正必获吉祥”，这是因为能居中守正，在欢乐中既不过分，也不会不满足，因而获得吉祥。",
"六三，盱豫悔；迟有悔。\n【白话】六三，有谄媚奉承暗送秋波的手段取悦于上司，以求得自己的欢乐，这势必导致悔恨。如若执迷不悟，悔恨不及时，就会招致更大的悔恨。\n《象》曰：“盱豫有悔”，位不当也。\n【白话】《象辞》说：“用谄媚奉承、暗送秋波的手段取悦于上司，以求得自己欢乐，这势必导致悔恨”，这是由于六三爻所处位置不正的缘故。",
"九四，由豫，大有得；勿疑，朋盍簪。\n【白话】九四，人们由于他而得到欢乐愉快，大有所获；毋庸置疑，朋友们会像头发汇聚于簪子一样，积聚在他周围。\n《象》曰：“由豫，大有得”，志大行也。\n【白话】《象辞》说：“人们由于得到欢乐愉快，大有所获”，表明九四爻的阳刚之志，可以放手实现。",
"六五，贞疾，恒不死。\n【白话】六五，国中出现了不少弊病，但仍能长时间地支持下去而不致灭亡。\n《象》曰：六五“贞疾”，乘刚也；“恒不死”，中未亡也。\n【白话】《象辞》说：《豫卦》的第五爻位（六五）指出，“国中出现了不少弊病”，但有刚强之臣辅佐，“仍能长时间地支持下去而不致灭亡”，这是因为它居中，只要保持中庸，就会长时间地坚持下去而不致于灭亡。",
"上六，冥豫成，有渝无咎。\n【白话】上六，已处在天昏地暗的局面之中，但却执迷不悟，仍沈溺于寻欢作乐之中，十分危险。但只要及时觉悟，改弦易辙，则可避免祸害。\n《象》曰：“冥豫”在上，何可长也？\n【白话】《象辞》说：“已处在天昏地暗的局面之中，但却执迷不悟，仍沈溺于寻欢作乐之中”，并高高在上，不察下情，这样的欢乐愉快怎能长久地保持呢？"],
"随卦":["初九，官有渝，贞吉。出门交，有功。\n【白话】初九，思想随时代而变化，坚持正道可获吉祥。出门交朋友，一定能成功。\n《象》曰：“官有渝”，从正吉也；“出门交，有功”，不失也。\n【白话】《象辞》说：“思想随时代而变化”，但无论怎么变，都必然始终遵从正道，这样就可以获得吉祥。“出站交朋友，一定能成功”，这是因为其唯正是从，见善则从，没有过失的缘故。\n",
"二，係小子，失丈夫。\n【白话】六二，倾心随从于年轻小子，则会失去了阳刚方正的丈夫。\n《象》曰：“係小子”，弗兼与也。\n【白话】《象辞》说：“倾心随从于年轻小子则会失去阳刚方正的丈夫”，因为二者是互相排斥的，是不可兼得的。\n",
"六三，係丈夫，失小子。随有求得，利居贞。\n【白话】六三，随从阳刚方正的丈夫行事，则必然丢失年轻小子。随从于丈夫，有求必得，有利于安居乐业，坚守妇道，贞节处世。\n《象》曰：“係丈夫”，志舍下也。\n【白话】《象辞》说：“随从阳刚方正的丈夫行事”，专心不二，说明其志在于舍弃下方的年轻小子。\n",
"九四，随有获，贞凶；有孚在道，以明，何咎！\n【白话】九四，他人追随自己，虽有收获，但有可能发生凶险。虽有凶险，但只要心存诚信，不违正道，使自己的美德显明，那还有什么危害呢？\n《象》曰：“随有获”，其义凶也。“有孚在道”，明功也。\n【白话】《象辞》说：“他人追随自己，虽有收获”，但因居位不当，有“震主”之嫌，所以可能有凶险。但只要“心存诚信，不违正道”，则可逢凶化吉，这是由于立身光明磊落所带来的功效。\n",
"九五，孚于嘉，吉。\n【白话】九五，把诚信带给诚实善良之人，可获吉祥。\n《象》曰：“孚于嘉，吉”，位正中也。\n【白话】《象辞》说：“把诚信带给诚实善良之人，可获吉祥”，这是因为九五爻得正居中，不倚不偏。\n",
"上六，拘係之，乃从，维之；王用亨于西山。\n【白话】上六，只有拘禁起来强迫、命令他，他才不得不顺服追随，再用绳索捆绑紧，才能追随到底。君王在西山设祭，要出师讨伐那些不顺从的人。\n《象》曰：“拘係之”，上穷也。\n【白话】《象辞》说：“只有拘禁起来强迫、命令他，他才不得不顺服追随”，这是因为上六爻高居《随卦》最上爻，物极必反的缘故。"],
"蛊卦":["初六，干父之蛊，有子考，无咎；厉终吉。\n【白话】初六，挽救父辈所败坏了的基业，由能干的儿子来继承父辈的事业，必无危害；即使遇到艰难险阻，只要努力奋斗，最终必获吉祥。\n《象》曰：“干父之蛊”，意承考也。\n【白话】《象辞》说：“挽救父辈所败坏了的基业”，表明其志在继承父辈的遗业。\n",
"九二，干母之蛊，不可贞。\n【白话】九二，救治母辈所造成的弊病，要耐心等待，如果时机不成熟的话，就要坚守正道等待时机。\n《象》曰：“干母之蛊”，得中道也。\n【白话】《象辞》说：“救治母辈所造成的弊病”，刚柔适中，既要顺应，又要匡救，不可偏颇。\n",
"\n九三，干父之蛊，小有悔，无大咎。\n【白话】九三，要挽救父辈败坏了的基业，其间必发生失误，因而会产生懊悔，但不会有大的危害。\n《象》曰：“干父之蛊”，终无咎也。\n【白话】《象辞》说：“挽救父辈败坏了的基业”，最终不会有祸害。\n",
"六四，裕父之蛊，往见吝。\n【白话】六四，宽缓地挽救父辈败坏了的基业，往前发展，必然会因耽误时机遗憾惋惜。\n《象》曰：“裕父之蛊”，往未得也。\n【白话】《象辞》说：“宽缓地挽救父辈所败坏了的基业”，往前发展，难以达到挽救的效果。\n",
"六五，干父之蛊，用誉。\n【白话】六五，挽救父辈败坏的基业，一定会受到人们的赞誉。\n《象》曰：“干父用誉”，承以德也。\n【白话】《象辞》说：“挽救父辈所败坏的基业，一定会受到人们的赞誉”，因为以美德继承父辈的遗业，总是会受到欢迎的。\n",
"上九，不事王侯，高尚其事。\n【白话】上九，不侍奉王侯，超然物外，孤芳自赏，使自己的德行至高无上。\n《象》曰：“不事王侯”，志可则也。\n【白话】《象辞》说：“不侍奉王侯”，这高洁的志向，可作为人们学习的准则。"],
"临卦":["初九，咸临，贞吉。\n【白话】初九，感应尊贵者，使其行督导之责。可获吉祥。\n《象》曰：“咸临，贞吉”，志行正也。\n【白话】《象辞》说：“感应尊贵者，使其行督导之责，可获吉祥”，说明其志向和行为都很正派。\n",
"九二，咸临，吉，无不利。\n【白话】九二，“感应尊贵者，使其行督导之责，可获吉祥”，不会有什么不利。\n《象》曰：“咸临，吉，无不利”，未顺命也。\n【白话】《象辞》说：“感应尊贵者，使其行督导之责，可获吉祥，不会有什么不利”，这是由于不囿于命运安排的樊笼，自身努力的结果。\n",
"六三，甘临，无攸利；既忧之，无咎。\n【白话】六三，居高临下，靠甜言蜜语去督导，必无所利；但是，已经觉悟，能忧惧改过，就不会有祸害。\n《象》曰：“甘临”，位不当也。“既忧之”，咎不长也。\n【白话】《象辞》说：“居高临下，靠甜言蜜语去督导”，这是因为六三爻位置不当的缘故。但是，“已经觉悟，能忧惧改过”，危害就不会长久了。\n",
"六四，至临，无咎。\n【白话】六四，亲善地督导下级，则必然没有祸害。\n《象》曰：“至临，无咎”位当也。\n【白话】《象辞》说：“亲善的督导下级，则必然没有祸害”，这是因为六四爻位置确当的缘故。\n",
"六五，知临，大君之宜，吉。\n【白话】六五，以聪明才智来实行督导，这是伟大君主最适宜的统治之道，能获得吉祥。\n《象》曰：“大君之宜”，行中之谓也。\n【白话】《象辞》说：“以聪明才智来实行督导，这是伟大君主最适宜的统治之道”，说的就是行中庸之道。\n",
"上六，敦临，吉，无咎。\n【白话】上六，温柔敦厚地实行督导，能获得吉祥，没有危害。\n《象》曰：“敦临之吉”，志在内也。\n【白话】《象辞》说：“温柔敦厚地实行督导，能获得吉祥”，说明其志在于利国利家（在内）。\n"],
"观卦":["初六，童观，小人无咎，君子吝。\n【白话】初六，像幼稚的儿童一样观察景物，这对无知的庶民来说，不会有害处，但对担任教化重任的君子来说，就未免有所憾惜。\n《象》曰：初六，“童观”，小人道也。\n【白话】《象辞》说：《观卦》的第一位（初六），“像幼稚的儿童一样观察景物”，这是浅薄的小人之道。\n",
"六二，闚观，利女贞。\n【白话】六二，由门缝中偷观景物，有利于妇女保持节操，坚持正道。\n《象》曰：“闚观，女贞”，亦可丑也。\n【白话】《象辞》说：“由门缝中偷观景物，对于妇女来说有利于坚持正道，固守贞操”，但对男子汉来说，这样的行为就丢丑了。\n",
"六三，观我生，进退。\n【白话】对照高尚的道德标准来省察自己的言行，审时度势，小心谨慎地决定进退。\n《象》曰：“观我生，进退”，未失道也。\n【白话】《象辞》说：“对照高尚的道德标准省察自己的言行，审时度势，小心谨慎地决定进退”，这样做是不失原则的。\n",
"六四，观国之光，利用宾于王。\n【白话】六四，瞻仰一个国家的文治武功，有利于成为君王的宾客和辅佐。\n《象》曰：“观国之光”，尚宾也。\n【白话】《象辞》说：“瞻观一个国家的文治武功”，说明此国崇尚贤士。\n",
"九五，观我生，君子无咎。\n【白话】九五，对照高尚的道德标准省察自己的言行，不断地完善自己，君子就不会有祸患。\n《象》曰：“观我生”，观民也。\n【白话】《象辞》说：“对照高尚的道德标准，审察自己的言行，弄清自己的德行”，便可知万民的德行。\n",
"上九，观其生，君子无咎。\n【白话】上九，君子时刻瞻仰君主的德行和作为，并按照君主的德行和作为行事，这样才不会有祸患。\n《象》曰：“观其生”，志未平也。\n【白话】《象辞》说：“君子时刻瞻仰君主的德行和作为”，因为君子始终以天下为己任，天下未安，其志难平。\n"],
"噬嗑":["初九，屦校灭趾，无咎。\n【白话】初九，足戴脚镣，断掉了脚趾头，不会有施刑过重的祸患。\n《象》曰：“屦校灭趾”，不行也。\n【白话】《象辞》说：“足戴脚镣，断掉了脚趾头”，受到警戒，不至于旧罪重犯。\n",
"六二，噬肤，灭鼻，无咎。\n【白话】六二，施刑伤及犯人的皮肤。即使毁掉犯人的鼻子，也不会有施刑过重的祸患上。\n《象》曰：“噬肤，灭鼻”，乘刚也。\n【白话】《象辞》说：“施刑伤及犯人的皮肤。毁掉犯人的鼻子”，这是因为必须用重刑使罪犯屈服。\n",
"六三，噬腊肉，遇毒；小吝，无咎。\n【白话】六三，实施刑法像咬坚硬的腊肉并遇到毒物那样不顺利，但这不过是稍有憾恨，还不至于有祸害。\n《象》曰：“遇毒”，位不当也。\n【白话】《象辞》说：“实施刑法像咬坚硬的腊肉并遇到毒物那样不顺利”，这是因为六三爻居位不正当的缘故。\n",
"九四，噬干子，得金矢；利艰贞，吉。\n【白话】九四，实施刑法像咬带骨头的肉那样困难，但因具有金箭般的刚直品德，因此有利于在艰难中坚守正道，其结果是吉利的。\n《象》曰：“利艰贞，吉”，未光也。\n【白话】《象辞》说：“有利于在艰难中坚守正道，其结果是吉利的”法治应该继续发扬光大。\n",
"六五，噬干肉，得黄金；贞厉，无咎。\n【白话】六五，实施刑法像吃干硬的肉脯那样艰难，但它具有黄金般的刚坚中和的品质。所以只要坚守正道，防备凶险，便无祸害。\n《象》曰：“贞厉，无咎”，得当也。\n【白话】《象辞》说：“只要坚守正道，防备凶险，便无祸害”，这是因为实施刑法得当的缘故。\n",
"上九，何校灭耳，凶。\n【白话】上九，肩负重枷，遭受严惩，失掉耳朵，有凶险。\n《象》曰：“何校灭耳”，聪不明也。\n【白话】《象辞》说：“肩负重枷，遭受严惩，失掉耳朵”，这是因为不听劝告，不能改恶从善，太不聪明了，结果受了这样的重刑。\n"],
"贲卦":["初九，贲其趾，舍车而徒。\n【白话】初九，装饰自己的脚趾头，舍弃乘坐车马而徒步行走。\n《象》曰：“舍车而徒”，义弗乘也。\n【白话】《象辞》说：“舍弃乘坐车马而徒步行走”，这是因为按道义不该乘坐车马。\n",
"六二，贲其须。\n【白话】六二，装饰长者的胡须。\n《象》曰：“贲其须”，与上兴也。\n【白话】《象辞》说：“装饰长者的胡须”，是说六二爻与它上面的九三爻同心而互饰之意。\n",
"九三，贲如，濡如，永贞吉。\n【白话】九三，装饰得光泽柔润，永远坚守正道，便可获得吉祥。\n《象》曰：“永贞之吉”，终莫之陵也。\n【白话】《象辞》说：“永远坚守正道，便可获得吉祥”，是说只有永久坚持正道，才能最终不受人凌辱。\n",
"六四，贲如，皤如，白马翰如；匪寇，婚媾。\n【白话】装饰得那样素雅：全身洁白如玉，乘坐着一匹雪白的骏马，轻捷地往前奔驰。前方的人并非敌寇，而是自己求聘的婚配佳人。\n《象》曰：“六四当位，疑也；”“非寇婚媾”，终无尤也。\n【白话】《象辞》说：六四爻虽则当位得正，但心中却疑虑重重。“前方的人并非敌寇，而是自己求聘的婚配佳人”。说明尽管放心前往，最终将无所怨恨。\n",
"六五，贲于丘园，束帛戋戋；吝，终吉。\n【白话】六五，装饰山丘陵园，质朴无华，再拿一束微薄的丝绢，来聘纳贤士；虽可能产生遗憾，然而最终必获吉祥。\n《象》曰：六五之吉，有喜也。\n【白话】《象辞》说：《贲卦》的第五爻位（六五）的吉祥，说明必有喜事临门。\n",
"上九，白贲，无咎。\n【白话】上九，装饰素白，不喜好华丽，没有祸害。\n《象》曰：“白贲，无咎”，上得志也。\n【白话】《象辞》说：“装饰素白，不喜好华丽，没有祸害”，说明正符合朴素无华的志向。"],
"剥卦":["初六，剥床以足，蔑，贞凶。\n【白话】初六，剥落床体先由床的最下方床腿部位开始，整个床腿都损坏了，结果必然凶险。\n《象》曰：“剥床以足”，以灭下也。\n【白话】《象辞》说：“剥落床体先由床的最下方床腿部位开始”，是说先损毁床的基础。基础损坏毁灭了，自然就会有凶险的情况发生，而且还会逐渐扩展波及到上面。\n",
"六二，剥床以辨，蔑，贞凶。\n【白话】六二，床腿剥掉后，又开始剥落床头，以至于整个床头都剥落了，结果必然凶险。\n《象》曰：“剥床以辨”，未有与也。\n【白话】《象辞》说：“床腿剥掉后，又开始剥落床头”，是因为六二爻没有相应的阳爻援助。由于没有外援，所以导致凶险的情况发生。\n",
"六三，剥，无咎。\n【白话】六三，虽被剥落，却没有什么灾祸。\n《象》曰：“剥之无咎”，失上下也。\n【白话】《象辞》说：“虽被剥落，却没有什么灾祸”，是因为六三脱离了上下阴爻的行列，而独与阳爻上九相应，由于它潜藏着阳刚的性质，所以仍然可以免灾祸。\n",
"六四，剥床以肤，凶。\n【白话】六四，床头剥落完了，又开始剥落床面，这样必然会有凶险发生。\n《象》曰：“剥床以肤”，切近灾也。\n【白话】《象辞》说：“床头剥落完了，又开始剥落床面”，是说已经迫近灾祸了。因为床面剥落损坏，必将危及到床上之人，所以说迫近灾祸了。\n",
"六五，贯鱼，以宫人宠，无不利。\n【白话】六五，鱼贯而入，像率领内宫之人顺承君主那样得到宠爱，就不会有什么不利的情况发生。\n《象》曰：“以宫人宠”，终无尤也。\n【白话】《象辞》说：“像率领内宫之人顺承君主那样得到宠爱”，最终当然不会有什么过失。",
"上九，硕果不食，君子得舆，小人剥庐。\n【白话】上九，硕大的果实不曾被摘取吃掉，君子若能摘食，则如同坐上大车，受到百姓拥戴；如果被小人摘食，则必然招致破家之灾。\n《象》曰：“君子得舆”，民所载也；“小人剥庐”，终不可用也。\n【白话】《象辞》说：“君子若能摘食，则如同坐上大车”，是由于百姓愿意拥戴君子；“如果被小人摘食，则必招致破家之灾”，是由于小人终究是不可以任用的。\n"],
"复卦":["初九，不远复，无祗悔，元吉。\n【白话】初九，刚刚开始行动，就能知过必改、复归正道，这样就不会发生灾祸，也不会出现内心的悔恨，必然会获得大吉大利。\n《象》曰：“不远之复”，以修身也。\n【白话】《象辞》说：“刚刚开始行动，就能有知过必改、复归正道的表现”，说明能注意自身修养。\n",
"六二，休复，吉。\n【白话】六二，以真善美做为自己行为的准则和目标，虽然有时会走弯路，但是，只要能够复归正道，就必然获得吉祥。\n《象》曰：“休复之吉”，以下仁也。\n【白话】《象辞》说：“以真善美为自己行为的准则和目标，能够复归正道，就必然获得吉祥”，是因为六二能够向下亲近具备仁德的人。\n",
"六三，频复，厉无咎。\n【白话】六三，屡次犯错误却又能屡次改正过错、复归正道，这样虽然有危险，但是最终却不会遇到灾祸。\n《象》曰：“频复之厉”，义无咎也。\n【白话】《象辞》说：“屡次犯错误却又能屡次改正过错、复归正道，这样虽然有危险”，但毕竟能够改过从善，复归正道，所以最终却不会遇到灾祸。\n",
"六四，中行独复。\n【白话】六四，位居阴爻的正中，独自专一地复归正道。\n《象》曰：“中行独复”，以从道也。\n【白话】《象辞》说：“位居阴爻的正中，独自专一地复归正道”，说明是为了奉行追随正道。\n",
"六五，敦复，无悔。\n【白话】六五，敦厚忠实地复归正道，内心不会有什么后悔。\n《象》曰：“敦复，无悔”，中以自考也。\n【白话】《象辞》说：“敦厚忠实地复归正道，内心不会有什么后悔”，是因为六五爻虽然远离阳刚，但却能够反省考察自己的言行以完善自我，通过这样的途径，促成自己返回正道。\n",
"上六，迷复，凶，有灾眚。用行师，终有大败；以其国，君凶。至于十年不克征。\n【白话】上六，犯了错误，仍然执迷不悟，不知悔改复归正道，这样必然凶险，会有天灾人祸不断降临发生。在这种情况下，用兵作战，终将一败涂地；用于治国，国君遭受凶险。这样的状况会一直持续下去，长达十年之久，国家不能振兴。\n《象》曰：“迷复之凶”，反君道也。\n【白话】《象辞》说：“犯了错误，仍然执迷不悟，不知悔改复归正道所产生的凶险”，是由于违背为君之道的缘故"],
"无妄":["初九，无妄，往吉。\n【白话】初九，只要是不妄动妄求的话，那么，前去行事就一定会获得吉祥。\n《象》曰：“无妄之往”，得志也。\n【白话】《象辞》说：“不妄动妄求地前去行事”，是说这样就可以实现志愿。\n",
"六二，不耕获，不菑畬，则利有攸往。\n【白话】六二，不在刚开始耕作时就期望立刻获得丰收，不在荒地刚开垦一年时就期望它立即变成良田，能够这样，才不是妄动妄求，因而利于前去行事。\n《象》曰：“不耕获”，未富也。\n【白话】《象辞》说：“不在刚开始耕作时就期望立刻获得丰收”，是说不企求获得非分的财富。\n",
"六三，无妄之灾，或系之牛，行人之得，邑人之灾。\n【白话】六三，无缘无故而遭受灾祸，好比有人把一头牛拴在村边道路旁，路过的人顺手把牛牵走，同村的人却被怀疑为偷牛的人而蒙受不白之冤。\n《象》曰：行人得牛，邑人灾也。\n【白话】《象辞》说：路过人顺手把牛牵走，意味着同村的人就会自然地被怀疑为偷牛的人而蒙受不白之冤。这种灾难不是因为自己有过，而是由于某种客观原因的巧合所造成的。\n",
"九四，可贞，无咎。\n【白话】九四，能够坚守正道，所以没有灾祸。\n《象》曰：“可贞，无咎”，固有之也。\n【白话】《象辞》说：“能够坚守正道，所以没有灾祸”，是说坚守正道的品德是其本身所固有的，所以，自始至终牢固地坚守正道，才能使自己免遭灾害。\n",
"九五，无妄之疾，勿药有喜。\n【白话】九五，不妄动妄求却身染疾病，这种疾病不需用药医治，它会不用治疗便自行消除。\n《象》曰：“无妄之药”，不可试也。\n【白话】《象辞》说：“不妄动妄求却身染疾病，这种疾病不需用药医治”，是说药是不可以轻易尝试，随便使用的，因为病本来就可以自行消除。\n",
"上九，无妄，行有眚，无攸利。\n【白话】上九，虽然不妄动妄求，但是，仍然不宜于行动，如果勉强地行动，就会遭受祸殃，得不到一点好处。\n《象》曰：“无妄之行”，穷之灾也。\n【白话】《象辞》说：“虽然没有妄为，但如有行动（却仍然遭受祸殃）”，这是由于客观的时遇所造成的灾祸，而不以人的意志为转移。\n"],
"大畜":["初九，有厉，利己。\n【白话】初九，不顾一切地贸然前进就会有危险的情况发生，这时只有暂时停下来不勉强前进才会有利。\n《象》曰：“有厉，利己”，不犯灾也。\n【白话】《象辞》说：“不顾一切地贸然前进就会有危险的情况发生，这时只有暂时停下来不勉强前进才会有利”，是说不必冒着灾难风险前进。\n",
"九二，舆说輹。\n【白话】九二，车子脱去轮輹自动停下来不再前进。\n《象》曰：“舆说輹”，中无尤也。\n【白话】《象辞》说：“车子脱去轮輹自动停下来不再前进”，说明九二爻虽然刚健急躁，但它能够自度量时，自动停止不前，所以没有贸然前进的过失。\n",
"九三，良马逐，利艰贞。曰闲舆卫，利有攸往。\n【白话】九三，骏马奔驰如同风驰电掣一般，但是，贸然前进有陷入危险的可能，所以应当警惕前进道路上的各种艰难，同时又应当坚守正道，这样才会安然无恙。只有娴熟地掌握了驾车和防卫的本领，才能利于前去行事。\n《象》曰：“利有攸往”，上合志也。\n【白话】《象辞》说：“利于前去行事”，是因为九三与上九志同道合，没有妨碍。\n",
"六四，童牛之牿，元吉。\n【白话】六四，给头上尚未长角的小牛预先装上一块横木，以防止它长出角后顶人，这是大吉大利的。\n《象》曰：六四“元吉”，有喜也。\n【白话】《象辞》说：《大畜卦》的第四爻位（六四）的“大吉大利”，是因为能够防患于未然，未雨而绸缪，因而是可喜的。\n",
"六五，豮豕之牙，吉。\n【白话】六五，面对长有锋利牙齿的猪，并不从如何除去它的牙齿上下手，而是避其锋利，击其要害，将它阉割。这样就可以制服它刚暴凶猛的本性，使它变得温顺，这样便能平安无事，获得吉祥。\n《象》曰：六五之吉，有庆也。\n【白话】《象辞》说：《大畜卦》的第五爻位（六五）的吉祥，是因为能够抓住事物的关键，从根本上予以治理，因而是可庆可贺的。\n",
"上九，何天之衢，亨。\n【白话】上九，四通八达，多么畅通无阻的天街大道，必然亨通顺利。\n《象》曰：“何天之衢”，道大行也。\n【白话】《象辞》说：“四通八达，多么畅通无阻的天街大道”，是说由于大量畜养积聚贤士，天下已经贤路大开了。\n"],
"颐卦":["初九，舍尔灵龟，观我朵颐，凶。\n【白话】初九，舍弃你如同神龟般的聪明智慧，痴呆地看着我鼓动腮帮子进食，结果必然导致凶险。\n《象》曰：“观我朵颐”，亦不足贵也。\n【白话】《象辞》说：“痴呆地看着我鼓动腮帮子进食”，是说初九爻虽重视保养身体，但由于不能坚守正道，并不值得推崇。\n",
"六二，颠颐，拂经，于丘颐，征凶。\n【白话】六二，反过来向下属乞求食物以获取奉养，是违背常理的，向高丘处的乞食，则前进的途中必然遭遇凶险。\n《象》曰：六二“征凶”，行失类也。\n【白话】《象辞》说：《颐卦》的第二爻位（六二）“前进的途中必然遭遇凶险”，是因为前进的途中没有相应的同类。\n",
"六三，拂颐，贞凶，十年勿用，无攸利。\n【白话】六三，违背颐养的正道，仍然一味地只求口腹之欲，结果必然遭遇凶险，在十年的漫长岁月里被遗弃而得不到养育，没有一点好处。\n《象》曰：“十年勿用”，道大悖也。\n【白话】《象辞》说：“在十年的漫长岁月里被遗弃而得不到养育”，是因为它与颐养的正道大相径庭，从根本上违背了养育他人和保养自己的原则和方法。\n",
"六四，颠颐，吉；虎视眈眈，其欲逐逐，无咎。\n【白话】六四，反过来向下属乞求食物以获取奉养，可以获得吉祥；因为这就像老虎要扑食那样，虎视眈眈，专心致志，孜孜以求，则必然能够达到目的，当然也没有什灾祸。\n《象》曰：“颠颐之吉”，上施光也。\n【白话】《象辞》说：“反过来向下属乞求食物以获取奉养的吉祥”，是因为六四位居在上，与初九照应，同时又能坚守正道，虽取之于民，却又用之于民，这也就是说，它能够向下普遍地施舍光明恩德。\n",
"六五，拂经，居贞吉，不可涉大川。\n【白话】六五，违背颐养的正道，但是却能够安然地居于尊位，所以结果吉祥，只是尚不能处理极为艰险困难的事情，就像不能够涉过大河一样。\n《象》曰：“居贞之吉”，顺以从上也。\n【白话】《象辞》说：“能够安然地居于尊位，所以结果吉祥”，是因为能够顺从有阳刚之美的贤者。\n",
"上九，由颐；厉吉，利涉大川。\n【白话】上九，天下百姓都依靠他的养育而得以安居乐业；肩负如此重任，必须谨防危险，有所戒惧才能获得吉祥，这样也才能排除万难，就像顺利涉过大河一样。\n《象》曰：“由颐厉吉”，大有庆也。\n【白话】《象辞》说：“天下百姓都依靠他的养育而得以安居乐业，必须谨防危险，有所戒惧才能获得吉祥”，是说养育天下百姓，因而能得到天下的信任和爱戴，达到普天同庆。\n"],
"大过":["初六，藉用白茅，无咎。\n【白话】初六，本来直接把器物放置在地上就可以了，现在又用白色的茅草衬垫在器物的下面，使它更加安稳，所以不会发生灾祸。\n《象》曰：“藉用白茅”，柔在下也。\n【白话】《象辞》说：“用白色的茅草衬垫在器物的下面”，是说行为非常小心谨慎，所以不会发生什么灾祸。\n",
"九二，枯杨生稊，老夫得其女妻，无不利。\n【白话】九二，已经枯萎的杨树重新又长出新的枝芽，老年男子娶了位年轻的妻子，这种现象没有什么不利的。\n《象》曰：“老夫女妻”，过以相与也。\n【白话】《象辞》说：“老年男子娶了位年轻的妻子”，虽为过分，但由于能够刚柔相济，所以不会发生不利的情况。\n",
"九三，栋桡，凶。\n【白话】九三，房屋的栋梁受重压而弯曲，结果必然发生凶险。\n《象》曰：“栋桡之凶”，不可以有辅也。\n【白话】《象辞》说：“房屋的栋梁受重压而弯曲，结果必然发生凶险”，是因为阳刚极为过分，所以不能再来辅助它，否则后果将不堪设想。\n",
"九四，栋隆，吉；有它，吝。\n【白话】九四，房屋的栋梁向上隆起，克服了弯曲，可以获得吉祥；不能再弯曲，再弯曲就会出问题。\n《象》曰：“栋隆之吉”，不桡乎下也。\n【白话】《象辞》说：“房屋的栋梁向上隆起，克服了弯曲，可以获得吉祥”，是由于九四爻本身能使栋梁不再向下弯曲。\n",
"九五，枯杨生华，老妇得其士夫，无咎无誉。\n【白话】九五，已经枯萎的杨树重新又盛开鲜艳的花朵，已经衰老的妇人嫁给了年富力强的男人，这种现象既不会遇到什么祸害，也没有什么值得称道的。\n《象》曰：“枯杨生华”，何可久也？“老妇士夫”，亦可丑也。\n【白话】《象辞》说：“已经枯萎的杨树重新又盛开鲜艳的花朵”，表面现象又怎么可以长久保持下去呢？“已经衰老的妇人嫁给了年富力强的男子”，这种婚配是会令人深感羞耻的。\n",
"上六，过涉灭顶，凶，无咎。\n【白话】上六，涉过深之水以至于淹没了头顶，就会发生凶险，但最终不会有祸患。\n《象》曰：“过涉之凶”，不可咎也。\n【白话】《象辞》说：“涉过深之水会发生凶险”，但如果能及时补救，还是可以化险为夷，最终不会有祸患。\n"],
"坎卦":["初六，习坎，入于坎窞，凶。\n【白话】初六，置身于重重的艰险困难之中，落入到陷坑的最底下，结果必然是凶险的。\n《象》曰：“习坎入坎”，失道凶也。\n【白话】《象辞》说：“置身于重重的艰险困难之中，落入到陷坑的最底下”，是因为不能坚守正道，自身软弱无能，又得不到外援，所以遭遇凶险。\n",
"九二，坎有险，求小得。\n【白话】九二，仍然处在陷坑之中面临危险，虽不能脱险，但在一定程度上还是可以解决一些小问题的。\n《象》曰：“求小得”，未出中也。\n【白话】《象辞》说：“虽不能脱险，但在一定程度上还是可以解决一些小问题的”，说明仍未脱离险境。\n",
"六三，来之坎坎，险且枕，入于坎窞，勿用。\n【白话】六三，往来进退都处在重重陷坑之间，面临危险难以得到安全，落入陷坑的最底下，在这种情况下，只有伏枕以待，不可轻举妄动。\n《象》曰：“来之坎坎”终无功也。\n【白话】《象辞》说：“往来进退都处在重重陷坑之间”，是说虽急于求得平安，结果是欲速则不达，最终还是不能摆脱危险，走出困境。\n",
"六四，樽酒，簋贰，用缶，纳约自牖，终无咎。\n【白话】六四，一樽酒，两簋饭，用瓦缶盛着进献，礼虽然很轻，然而却充满了深厚的情意，正大光明地表示诚信，最终不会发生灾祸。\n《象》曰：“樽酒簋贰”，刚柔际也。\n【白话】《象辞》说：“一樽酒两簋饭”，是说在艰险困难的情况下能够推心置腹、相互信任地交往，刚柔相济，所以最终免遭灾祸。\n",
"九五，坎不盈，祇既平，无咎。\n【白话】九五，奔流的水还未溢出陷坑，然而却已和陷坑平齐了，还不会发生灾害。\n《象》曰：“坎不盈”，中未大也。\n【白话】《象辞》说：“奔流的水还未溢出陷坑”，说明居中而不自大，所以，还不会发生灾害。\n",
"上六，系用徵纆，置于丛棘，三岁不得，凶。\n【白话】上六，被绳索重重地捆绑住，囚放在荆棘丛生的牢狱中，长达三年不能解脱，十分凶险。\n《象》曰：上六失道，凶三岁也。\n【白话】《象辞》说：《坎卦》的第六爻位(上六)面临艰险困难，不能坚守正道，所以遭受三年的凶险。\n"],
"离卦":["初九，履错然，敬之，无咎。\n【白话】初九，在开始行事时，由于急于求成而出现错乱，后来能恭敬慎重且未轻举妄动，结果没有发生什么灾祸。\n《象》曰：“履错之敬”，以辟咎也。\n【白话】《象辞》说：“在开始行事时，由于急于求成而出现错乱，后来能恭敬慎重且未轻举妄动”，主要是为了避免灾祸的发生。\n",
"六二，黄离，元吉。\n【白话】六二，附着在黄色上，就可以获得大吉大利。\n《象》曰：“黄离元吉”，得中道也。\n【白话】《象辞》说：“附着在黄色上，就可以获得大吉大利”，是因为黄色代表中，坚守正道，可以获得大吉大利。\n",
"九三，日昃之离，不鼓缶而歌，则大耋之嗟，凶。\n【白话】九三，夕阳西下，好比人生已入老年，这时如果不能敲着瓦器伴唱高歌地欢度晚年，就难免会有春蚕将死、蜡炬成灰的哀叹，这样必然遭遇凶险。\n《象》曰：“日昃之离”，何可久也！\n【白话】《象辞》说：“夕阳西下，好比人生已步入老年”，太阳偏西即将落下，人步入老年呢？即将死去，怎么能长久呢！\n",
"九四，突如其来如，焚如，死如，弃如。\n【白话】九四，突然间发出万道光芒，犹如燃烧的烈火，但顷刻之间又烟消云散，不复存在，落得个被抛弃的下场。\n《象》曰：“突如其来如”，无所容也。\n【白话】《象辞》说：“突然间发出万道光芒，犹如燃烧的烈火”，这种刚烈暴躁的气焰，必然带来危险，是天下人所不能容忍的。\n",
"六五，出涕沱若，戚嗟若，吉。\n【白话】六五，眼泪像泉水一样不停地涌出，纷纷从面颊上流下，忧愁悲伤地叹息，居安思危到了这种程度，必将获得吉祥。\n《象》曰：六五之吉，离王公也。\n【白话】《象辞》说：《离卦》的第五爻位(六五)之所以能够获得吉祥，是由于它附着在君主旁，受到了君主的庇佑。\n",
"上九，王用出征，用嘉折首，获匪其丑，无咎。\n【白话】上九，君主动有军队出兵征伐，建功立业，获得美誉，斩杀敌方首领，捕获不愿归附者，这样做不会发生灾祸。\n《象》曰：“王用出征”，以正邦也。\n【白话】《象辞》说：“君主动用军队出兵征伐”，是为了治理国家，并非是为了耀武扬威，滥杀无辜。所以，进行正义的战争，就不会发生灾祸。\n"],
"咸卦":["初六，咸其拇。\n【白话】初六，感应发生在脚的大拇趾上。\n《象》曰：“咸其拇”，志在外也。\n【白话】《象辞》说：“感应发生在脚的大拇趾上”，说明其感应志向是向外追求。\n",
"六二，咸其腓，凶；居吉。\n【白话】六二，感应发生在小腿肚上，是由于急躁妄动，这样就会发生凶险的事情；若是安居静处，便可以获得吉祥。\n《象》曰：虽凶居吉，顺不害也。\n【白话】《象辞》说：虽然会发生凶险的事情，但是只要安居静处，便可以避灾远祸了。\n",
"九三，咸其股，执其随，往吝。\n【白话】九三，感应发生在大腿上，一味地跟随着别人任意妄动，这样前去行事，必然导致灾祸。\n《象》曰：“咸其股”，亦不处也；“志在随人”，所执下也。\n【白话】《象辞》说：“感应发生在大腿上”，说明不能安居静处，自我克制，而是性情急躁，随心所欲地任意妄为；“盲目地跟随别人任意妄为”，是因为它所执意追求的过于低下卑劣了。\n",
"九四，贞吉，悔亡；憧憧往来，朋从尔思。\n【白话】九四，内心保持纯洁无邪的态度，就可以获得吉祥，没有后悔；心猿意马地与朋友交往，朋友会报答你的情意。\n《象》曰：“贞吉悔亡”，未感害也；“憧憧往来”，未光大也。\n【白话】《象辞》说：“内心保持纯洁无邪的态度，就可以获得吉祥，没有后悔”，说明九四爻并没有因感应而遭受祸害；“心猿意马地与朋友交往”，朋友面必然窄，影响也小，不能遍及于天下人。\n",
"九五，咸其脢，无悔。\n【白话】九五，感应发生在脊背的肉上，不会发生后悔。\n《象》曰：“咸其脢”，志未也。\n【白话】《象辞》说：“感应发生有脊背的肉上”，说明其只知独善其身，这样它的志向难免过于浅薄了。\n",
"上六，咸其辅、颊、舌。\n【白话】上六，感应发生在牙床、脸颊、舌头上。\n《象》曰：“咸其辅、颊、舌”，滕口说也。\n【白话】《象辞》说：“感应发生在牙床、脸颊、舌头上”，说明其只是玩弄三寸不烂之舌而已。\n"],
"恒卦":["初六，浚恒，贞凶，无攸利。\n【白话】初六，刨根挖底地深入追求常久之道，结果必然凶险，没有一点好处。\n《象》曰：“浚恒之凶”，始求深也。\n【白话】《象辞》说：“刨根挖底地深入追求常久之道所产生的凶险”，是因为事情刚开始，追求的目标就过于深远的缘故。",
"九二，悔亡\n【白话】九二，悔恨自行消除。\n《象》曰：九二“悔亡”，能久中也。\n【白话】《象辞》说：《恒卦》的第二爻位(九二)能够使“悔恨自行消除”，是由于它能够常久地守中不偏的缘故。\n",
"九二，悔亡\n【白话】九二，悔恨自行消除。\n《象》曰：九二“悔亡”，能久中也。\n【白话】《象辞》说：《恒卦》的第二爻位(九二)能够使“悔恨自行消除”，是由于它能够常久地守中不偏的缘故。\n",
"九四，田无禽。\n【白话】九四，田间狩猎，结果却没有捕获到任何禽兽。\n《象》曰：久非其位，安得禽也？\n【白话】《象辞》说：长久地处在不属于自己应该处的位置上，又怎么能够捕获到禽兽呢？\n",
"六五，恒其德，贞；妇人吉，夫子凶。\n【白话】六五，常久地保持柔顺服从的美好品德，永远坚守正道；这样的话，女人可以获得吉祥，男人则遭遇凶险。\n《象》曰：妇人贞吉，从一而终也；夫子制义，从妇凶也。\n【白话】《象辞》说：女人坚守正道可以获得吉祥，是说女人一生应该只嫁一个丈夫，终身都不能改嫁他人；男人遇事应当果断处理，如果像女人那样只知顺从、优柔寡断的话，就会遭遇凶险。\n",
"上六，振恒，凶。\n【白话】上六，摇摆不定，不能坚守常久之道，结果必然凶险。\n《象》曰：振恒在上，大无功也。\n【白话】《象辞》说：摇摆不定，不能坚守常久之道，但是又高高在上，终将一无所成，不会有所建树。\n"],
"遁卦":["初六，遯尾；厉。勿用有攸往。\n【白话】初六，隐退避让错过时机落在了后边，情况非常不好。面对这种情形，应该静观待变而不要有所行动，否则将会更加不利。\n《象》曰：遯尾之厉，不往何灾也？\n【白话】《象辞》说：错过隐退避让的时机却还要隐退就会带来祸患，但是静观不动就不会造成什么危害。\n",
"六二，执之用黄牛之革，莫之胜说。\n【白话】六二，像用黄牛的皮捆绑起来那样，谁也难以解脱。\n《象》曰：执用黄牛，固志也。\n【白话】《象辞》说：“像用黄牛的皮捆绑起来那样”，意思是说，要坚定自己的志向，决不因任何情况而动摇。\n",
"九三，系遯，有疾厉，畜臣妾，吉。\n【白话】九三，由于被牵累而难以远去，就像疾病缠身那样危险。处在这情况下，就要畜养仆人和侍妾，要使他们被我所用，只有这样，才能转危为安。\n《象》曰：“系遯之厉”，有疾惫也。“畜臣妾吉”，不可大事也。\n【白话】《象辞》说：“由于被牵累而难以远去，会有危险”，因为在这种想退而又不能退的情况下，就像疾病缠身那样使人疲惫不堪。“畜养仆人和侍妾就会吉祥”，的意思是说，处在有所系累的情况下，是不可能有什么大作为的。\n",
"九四，好遯，君子吉，小人否。\n【白话】九四，可以从容隐退避让而无所系累。君子将因此而获得吉祥，小人却不会吉祥。\n《象》曰：君子好遯，小人否也。\n【白话】《象辞》说：君子能够做到该退就退，从容自如，而小人却做不到这一点。\n",
"九五，嘉遯，贞吉。\n【白话】九五，能够进退自如地隐退避让，能坚守正道，其结果是吉祥的。\n《象》曰：“嘉遯，贞吉”，以正志也。\n【白话】《象辞》说：“能够自如地隐退避让，坚守正道将会获得吉祥”，关键是要坚定自己的信念和志向。\n",
"上九，肥遯无不利。\n【白话】上九，既无牵累，又已远离，早已处在隐退避让中，就像是远走高飞一样，所以无论这时做什么，都不会有什么不利。\n《象》曰：“肥遯无不利”，无所疑也。\n【白话】《象辞》说：之所以它能够“随心所欲地远走高飞而又无不利”，就在于它所做的一切都是理所当然和自然而然的，没有什么疑虑和思索选择的。"],
"大壮":["初九，壮于趾，征凶；有孚。\n【白话】初九，阳刚强盛只在脚趾。这时如果有所行动，必然会招来灾祸。\n《象》曰：“壮于趾”孚穷也。\n【白话】《象辞》说：爻辞中的“阳刚强盛只在脚趾”一句，说明只停留在这一状态下，是决不会有什么出路的。\n",
"九二，贞吉。\n白话，九二，坚守正道而获得吉祥。\n《象》曰：九二“贞吉”，以中也。\n【白话】《象辞》说：《大壮卦》的第二爻位（九二）之所以能够坚守正道而获得吉祥，是因为它位置居中，能够以柔相出的原因。\n",
"九三，小人用壮，君子用罔；贞厉，羝羊触藩，羸其角。\n【白话】九三，小人恃强好胜，君子却恰恰相反。而且，即使逞强好胜者能够保持住阳刚强盛，其结果也决不会好。就像强壮的大羊去顶触篱笆，结果只会把角卡在篱笆中而难以摆脱。\n《象》曰：小人用壮，君子罔也。\n【白话】《象辞》说：小人恃强好胜，君子却不这样。",
"九四，贞吉，悔亡；藩决不羸，壮于大舆之輹。\n【白话】九四，坚守正道，必获吉祥，悔恨也会消失；因为阳刚十分强盛，既像篱笆已经崩溃，羊角从系累中解脱出来，又像坚固的车轮能负重载远那样。\n《象》曰：“藩决不羸”，尚往也。\n【白话】《象辞》说：“篱笆崩溃，羊角从系累中解脱出来”的内在含义是，鼓励君子要充分行动起来，积极向前进取。",
"六五，丧羊于易，无悔。\n【白话】六五，在田边地头丢失了羊，却并没有什么可遗憾的，不会有什么不利的情况发生。\n《象》曰：“丧羊于易”，位不当也。\n【白话】《象辞》说：“在田边地头丢失了羊”，是由于其位置不恰当。\n",
"上六，羝羊触藩，不能退，不能遂，无攸利；艰则吉。\n【白话】上六，强壮的羊因顶触篱笆而被挂住了角，既不能后退，又不能前进，怎样挣扎都没有好处。在这种情况下，要能够忍耐坚持，不被艰难困苦所压垮，就会安然渡过难关，获得吉祥。\n《象》曰：“不能退，不能遂”，不详也；“艰则吉”咎不长也。\n【白话】《象辞》说：“既不能后退，又不能前进”，说明行动处事不够圆满周到，结果陷入了极为被动的局面。而“忍耐坚持，承受艰难困苦而不被压垮，就会吉祥”，说明，只要能够坚持忍耐，就一定会渡过难关。\n"],
"晋卦":["初六，晋如摧如，贞吉；罔孚，裕无咎。\n【白话】初六，刚开始前进就遇到了障碍和阻拦，但是只要能够坚守正道，始终如一，就一定会吉祥如意。由于它还没有树立起自己的威望，所以能够不受约束地去处理问题，而不必担心会有什么过失。\n《象》曰：“晋如摧如”，独行正也；“裕无咎”，未受命。\n【白话】《象辞》说：“向前进遇到障碍和阻拦时”，要能够持之以恒，按照自己所遵循的原则继续不断地努力，才会得到吉祥如意的结果。“随意行动也不会有什么过失”，是因为它还没有被赋予什么权力、责任和使命。\n",
"六二，晋如愁如，贞吉；受兹介福，于其王母。\n【白话】六二，前进时充满忧愁思虑，但是如果能坚守正道，始终如一，将会吉祥如意。而且会获得极大的恩惠和福泽，是高高在上的王母所赐给他的。\n《象》曰：“受兹介福”，以中正也。\n【白话】《象辞》说：之所以能够“获得极大的恩惠和福泽”，是因为它位置居中，行为符合身份和正道。\n",
"六三，众允，悔亡。\n【白话】六三，它的所作所为已经得到了众人的认可和赞同，努力进取，悔恨将会消失。\n《象》曰：“众允”之志，上行也。\n【白话】《象辞》说：“得到众人认可和赞同”的志向，是要努力向前奋斗。",
"九四，晋如鼫鼠，贞厉。\n【白话】九四，向上迈进像那既贪婪又怕人，而且没有什么专长的梧鼠一样，即使能够严守自己的本分，也免不了灾祸。\n《象》曰：“鼫鼠贞厉”，位不当也。\n【白话】《象辞》说：之所以“像梧鼠那样，即使能够严守自己的本分，也免不了灾祸”，是因为它所在的位置不对。\n",
"六五，悔亡，失得勿恤；往吉，无不利。\n【白话】六五，悔恨已经消失，也有不着考虑得失的问题。只要勇往直前，就会吉祥如意，所有的一切都变得是那样的顺利。\n《象》曰：“失得勿恤”，往有庆也。\n【白话】《象辞》说：“用不着考虑丢失”，只要继续努力奋斗，就必然会有吉祥福庆的。",
"上九，晋其角，维用伐邑，厉右，无咎；贞吝。\n【白话】上九，向前迈进似乎已经达到了顶点，就像到达兽角尖上一样，盛大的气象已不复存在了。只有像攻打城池那样，建立新的功勋，或许可以避免灾难转为吉祥；而且一旦这样做了，将不会产生过失。但即使如此，它以后的发展趋势也只能是越来越差。\n《象》曰：“维用伐邑”，道未光也。\n【白话】《象辞》说：“只有像攻打城池那样”，说明前进繁盛已经达到了顶点，再也难以发展光大了。\n"],
"明夷":["初九，明夷于飞，垂其翼；君子于行，三是不食。有攸往，主人有言。\n【白话】初九，在光明被阻的时候，要像鸟儿一样地迅速飞走，而且要低垂着翅膀以免被人察觉。君子若要退避隐藏，就是丢掉职位、没有饭吃也不在乎。但君子若在此时行动，必然要受到当政者的责备。\n《象》曰：“君子于行”，义不食也。\n【白话】《象辞》说：“君子隐藏退避”是由于坚持道义和原则而不愿再拿这份俸禄了。",
"六二，明夷，夷于左股，用拯马壮，吉。\n【白话】《明夷卦》的第二爻位（六二），处在这种光明被阻的情况下，就像伤了左大腿一样，如果能借用好马，增加自己的力量，将会是有利的。\n《象》曰：六二之吉，顺而则也。\n【白话】《象辞》说：六二爻之所以能够获得吉祥，是因为它柔顺而又坚持原则。\n",
"九三，明夷于南狩，得其大首；不可疾，贞。\n【白话】九三，君主在光明受阻的情况下，到南方去巡狩，将可以消灭罪恶的首领。但是应该注意不要操之过急，要能够坚守正道，持之以恒。\n《象》曰：南狩之志，乃大得也。\n【白话】《象辞》说：有到南方征伐巡狩的志向，就会有非常大的收获。",
"六四，入于左腹，获明夷之心，于出门庭。\n【白话】六四，进入左方腹部，能够深入了解光明被阻的内中情况，于是坚定地跨出门庭，离开这里。\n《象》曰：“入于左腹”，获心意也。\n【白话】《象辞》说：“进入左方腹部”，因此能够从内部深刻了解光明受阻的情形。",
"六五，箕子之明夷，利贞。\n【白话】六五，应采取箕子那种自掩其聪明才智的做法，这样做有利于坚守正道。\n《象》曰：箕子之贞，明不可息也。\n【白话】《象辞》说：箕子坚守正道，保持自我的行为说明，光明是不会熄灭的，只是暂时受阻碍罢了。\n",
"上六，不明晦；初登于天，后入于地。\n【白话】上六，不但没有光明，反而带来黑暗。刚开始时升起在天空，而后来却堕入地下。\n《象》曰：“初登于天”，照四国也；“后入于地”失则也。\n【白话】《象辞》说：“刚开始时升起在天空”，是说它的光明能够普照四方各国；“而后来却堕入地下”，是说它已经因违背正道而丧失了应有的作用，由光明转入了黑暗。"],
"家人":["初九，闲有家，悔亡。\n【白话】初九，治家应从一开始就打好基础，立下规矩，防患于未然。如果这样做了，就不会有什么过失了。\n《象》曰：“闲有家”，志未变也。\n【白话】《象辞》说：“治家应从一开始就打好基础，立下规矩，防患于未然”，意义就在于开一个好头十分重要。如果等到出现了问题再去想办法，效果就差得多了。\n",
"六二，无攸遂，在中馈，贞吉。\n【白话】六二，不要自作主张，追求功名，能够料理好家中的饮食起居就行了，结果一定是吉祥的。\n《象》曰：六二之吉，顺以巽也。\n【白话】《象辞》说：《家人卦》的第二爻位（六二）这所以能够吉祥如意，是因为它位置居中，符合常规，而且温柔顺从的缘故。\n",
"九三，家人嗃嗃，悔厉，吉；妇子嘻嘻，终吝。\n【白话】九三，由于治家过分严厉，使得家里人承受不了而怨言丛生，这样做虽然有过失，会带来麻烦，但是从长远看，最终会得到吉祥的。可是如果不能从严治家，听凭妇人和孩子们随心所欲，最终的发展结果却决不会好。\n《象》曰：“家人嗃嗃”，未失也；“妇子嘻嘻”，失家节也。\n【白话】《象辞》说：“由于过分严厉使得家中人怨言丛生，但最终却可以得到吉祥”，是因为这样做是符合治家的原则的，虽然有过失，但不失根本。而听凭“妇人和孩子随心所欲，最终的发展结果却决不会好”，是因为这样做违背了治家的原则和规矩。\n",
"六四，富家，大吉。\n【白话】六四，能够使家中的财富增加，就一定会非常吉祥如意。\n《象》曰：“富家大吉”，顺在位也。\n【白话】《象辞》说：六四之所以“能够使家中的财富增加，一定会非常吉祥如意”，是由于它柔顺的本性决定的。\n",
"九五，王假有家，勿恤，吉。\n【白话】九五，一家之主通过自己的行为感染带动家里的人，使他们各自都按照自己的本分和职责去做，是会吉祥如意的。\n《象》曰：“王假有家”，交相爱也。\n【白话】《象辞》说：“一家之主通过自己的行为感染带动家里的人，是会吉祥如意的”，关键是要能使全家人和睦相处，感情融洽，相亲相爱。\n",
"上九，有孚，威如，终吉。\n【白话】上九，治家的根本在于严格要求自己，如果自己能够诚实有信，树立起威信，结果一定会获得吉祥。\n《象》曰：威如之吉，反身之谓也。\n【白话】《象辞》说：之所以建立尊严和威信能够获得吉祥，是因为这种尊严和威信是通过严格要求自己得到的，而不是通过其他方式。\n"],
"睽卦":["初九，悔亡；丧马，勿逐自复；见恶人，无咎。\n【白话】初九，悔恨消失；跑掉的马不要去撵它，它自己就会回来。接近同自己对立敌视的人，不会有什么祸患。\n《象》曰：“见恶人”，以辟咎也。\n【白话】《象辞》说：“接近同自己相对立敌视的人”，通过这种方法彼此沟通，以避免因更加对立而带来的危害。",
"九二，遇主于巷，无咎。\n【白话】九二，在小巷中碰到了居于高位者，虽然不合常规，但是却没有什么危险和灾难。\n《象》曰：“遇主于巷”，未失道也。\n【白话】《象辞》说：“在小巷中碰到了居高位者”，虽然这不合常规，但是却并不违背原则。",
"六三，见舆曳，其牛掣；其人天且劓。无初有终。\n【白话】六三，就像后边的车被托住，前面的牛又被限制，处境极为困难；又像是受了除掉头发和割掉鼻子的刑罚；虽然开始时是这样的困难和难以相合，但最终还是可以达到自己的目的的。\n《象》曰：“见舆曳”，位不当也；“无初有终”，遇刚也。\n【白话】《象辞》说：“像车子被拖住”的情形是因为六三爻所处的位置不恰当。“开始时极为困难，但最终还是可以达到目的”的原因，在于能和阳刚相应合。\n",
"九四，睽孤；遇元夫，交孚，厉无咎。\n【白话】九四，到处都是对立，孤独无援，但正好遇到了一位充满阳刚的大丈夫，彼此信任，相互理解，虽有危险，但却能免去灾祸。\n《象》曰：“交孚无咎”，志行也。\n【白话】《象辞》说：“相互理解，虽有危险，但却能免去灾祸”，就在于他们有着共同的志向和行动。\n",
"六五，悔亡，厥宗噬肤，往何咎？\n【白话】六五，悔恨消失，像柔软的皮肤那样一咬就入，放开前进，能有什么危害呢？\n《象》曰：“厥宗噬肤”，往有庆也。\n【白话】《象辞》说：“像柔软的皮肤那样一咬就入”，表明前进必然会有值得庆贺的事情。\n",
"上九，睽孤，见豕负涂，载鬼一车，先张之弧，后说之弧；匪寇，婚媾；往遇雨则吉。\n【白话】上九，对立已达到了顶点，似乎看到一只沾满污泥的猪和装满了鬼的车子，于是就拉开了弓准备对付它，但是后来又放下了弓。因为冷静下来一看，发现并不是强盗，而是要和自己结婚的伴侣。所以这时如果能前往，就会像遇到阴阳相配形成润泽的雨一样，顺乎自然，合乎天意，将一定会获得吉祥。\n《象》曰：“遇雨之吉”，群疑亡也。\n【白话】《象辞》说：“像遇到阴阳相配形成润泽的雨一样，会获吉祥”，是说原来的种种怀疑都已经烟消云散，不复存在了。\n"],
"蹇卦":["初六，往蹇，来誉。\n【白话】初六，前进将会进入险境，后退将得到赞美。\n《象》曰：“往蹇来誉”，宜待也。\n【白话】《象辞》说：“前进将会进入险境，后退将得到赞美”，处在这种情况下，最好是安心等待，寻找时机，不要轻举妄动。\n",
"六二，王臣蹇蹇，匪躬之故。\n【白话】六二，臣子为了解救君王的困境努力奔走在危难之中。如果是为了自己，他是用不着这样做的。\n《象》曰：“王臣蹇蹇”，终无尤也。\n【白话】《象辞》说：“臣子为了解救君主的困境而努力奔走在危难之中”，那么结果将不会有什么过失。",
"九三，往蹇，来反。\n【白话】九三，前进陷于危难，最好还是退回原地，不要再继续往前走了。\n《象》曰：“往蹇来反”，内喜之也。\n【白话】《象辞》说：“前进将陷于危难，最好还是回原地”，这样内部的力量必会来依附于己。\n",
"六四，往蹇，来连。\n【白话】六四，如果它要奔赴危难，就该联合其他的力量，只有这样，才有可能解救危难。\n《象》曰：“往蹇来连”位当实也。\n【白话】《象辞》说：“前去解救危难，应该联合其他的力量”，是指这一爻所处的位置决定了他应该这样去做。\n",
"九五，大蹇，朋来。\n【白话】九五，处境极为艰难，却有众多的人来协助他渡过危难。\n《象》曰：“大蹇朋来”以中节也。\n【白话】《象辞》说：“处境极为艰难，却有众多的人来协助他渡过危难”，表明他能够坚守正道，行为合乎准则，所以有众多的人前来协助他。\n",
"上六，往蹇，来硕；吉；利见大人。\n【白话】上六，如果前进就会陷入险境，退回来却可以大有收获；这样做就会吉祥如意；有利于出现大人物。\n《象》曰：“往蹇来硕”，志在内也；“利见大人”，以从贵也。\n【白话】《象辞》说：“如果前进就会陷入险境，退回来却可以大有收获”，是因为关鍵在于首先要联合自己内部的各种力量才能够共同度过艰难时世。“利于出现大人物”，说明应当追随尊贵的君主去建功立业。\n"],
"解卦":["初六，无咎。\n【白话】初六，处在危难才解的情形下，是没有什么过失和不当的。\n《象》曰：刚柔之际，义无咎也。\n【白话】《象辞》说：处在刚柔相济、相辅相成的地位，是不会有什么过失和不当的。\n",
"九二，田获三狐，得黄矢；贞吉。\n【白话】九二，打猎时捕获许多只狐狸，又得到了象征美德的黄色箭矢，保持这种品德并坚守自己的职责而持之以恒，那将会是非常吉祥的。\n《象》曰：九二贞吉，得中道也。\n【白话】《象辞》说：《解卦》的第二爻位（九二）之所以能获得吉祥，是因为它能够遵循中正之道，符合事物发展的规律。\n",
"六三，负且乘，致寇至；贞吝。\n【白话】六三，肩扛着沉重的东西，却又坐在华丽的大车上，由于地位和身份不相称，必然招来强盗。因而，即使他能够坚守本分，其结果也决不会好的。\n《象》曰：“负且乘”，亦可丑也；自我致戎，又谁咎也？\n【白话】《象辞》说：“肩扛着沉重的东西，却又坐在华丽的大车上”，这样的行为简直是太丑陋了，必然会带来灾祸。由于自己的原因而招致战祸，这又能去责怪谁呢？只能是自作自受罢了。\n",
"九四，解而拇，朋至斯孚。\n【白话】九四，如果能像伸展自怀的拇指那样摆脱小人对自己的纠缠，志同道合的人就会真心信任，坦诚相助。\n《象》曰：“解而拇”，未当位也。\n【白话】《象辞》说：“像伸展自己的拇指那样去摆脱小人的纠缠”，是因为其所处位置不正的缘故。\n",
"六五，君子维有解，吉，有孚于小人。\n【白话】六五，君子只有消除解脱了危难祸患，才会有吉祥如意；同时，也只有这样，才有可能去赢得小人的信服。\n《象》曰：君子有解，小人退也。\n【白话】《象辞》说：君子如果能够消除解脱危难祸患，小人就自然会畏惧退避的。\n",
"上六，公用射隼于高墉之上，获之，无不利。\n【白话】上六，卓越的王公，用箭去射那盘踞在高城上的恶鸟，一箭射中，没有什么不利的。\n《象》曰：“公用射隼”，以解悖也。\n【白话】《象辞》说：“像王公用箭射杀恶鸟”那样，君主应如此去解除因悖逆所造成的危难。"],
"损卦":["初九，已事遄往，无咎；酌损之。\n【白话】初九，停下正在做的事情赶快前去助人，就不会有灾难临头，损已助人时要再三斟酌把握分寸。\n《象》曰：“已事遄往”，尚合志也。\n【白话】《象辞》说：“停下正在做的事情赶快前去助人”，处在尊位的柔弱之辈正需要帮助，地位卑下的阳刚之士首当其冲，义不容辞，立刻牺牲自己的事业而成人之美，表现出尊贵者心心相印的关系。\n",
"九二，利贞，征凶；弗损益之。\n【白话】九二，利于坚守正道，主动出击会有凶险；几乎用不着自我减损就可以使尊贵者受益。\n《象》曰：九二利贞，中以为志也。\n【白话】《象辞》说：《损卦》的第二爻位（九二）之所以利于坚守正道，是因为处在不高不下的适中位置上，本身地位又不很稳固，不宜于积极行动。只有持不偏不激也不过于保守的中庸态度，作为始终不变的志向，才能够使他人受益。\n",
"六三，三人行，则损一人；一人行，则得其友。\n【白话】六三，三个人一同前进，由于互相掣肘会使一个人受到伤害；一个人独自行动，就会专心一意地寻求伙伴，最终必定能遇到志同道合的朋友。\n《象》曰：一人行，三则疑也。\n【白话】《象辞》说：一个人前去无牵无挂，目的明确，可以顺利地得到接应，取得成功。三个人一齐前去，则会相互猜疑而达不到预期的目的。说明损下益上不能不分情况地一窝蜂上，而要审时度势，讲求实效。\n",
"六四，损其疾，使遄有喜。无咎。\n【白话】六四，尽量减损克服自身的弱点，准备迎接马上到来的喜庆，不会有任何灾祸。\n《象》曰：“损其疾”，亦可喜也。\n【白话】《象辞》说：“尽量减损克服自身的弱弱点”，意思是说，本身很柔弱，又处在比较尊贵的地位上，不可能通过自我减损来使他人受益。只有尽量减损克服自身的弱点，等待接受别人助益。但无论哪种减损，哪怕是这种减损克服自身弱点的举动，也是十分可喜的事情。",
"六五，或益之十朋之龟，弗克违，元吉。\n【白话】六五，有人送来价值十朋（古时候货币单位，双贝为一朋）的大宝龟，想推辞都不行，大吉大利。\n《象》曰：六五元吉，自上佑也。\n【白话】《象辞》说：《损卦》的第五爻位（六五）之所以获得大吉大利，完全是上天保佑的结果。因为六五爻本身阴柔，居于尊位，仍想着自我减损而使他人受益。这样不但得到大众的广泛助益，也搏得了上天的好感。\n",
"上九，弗损益之；无咎，贞吉，有攸往，得臣无家。\n【白话】上九，用不着自我减损就可以使他人受益；没有一点灾患，占卜的结果十分吉利，前去行事，定能获得天下万民归心。\n《象》曰：“弗损益之”，大得志也。\n【白话】《象辞》说：“用不着自我减损就可以使他人受益”，是因为处在损卦最高位置，损极必反，本身所获取的大量的助益，使得能够不用自我减损就可以有益他人，这当然是损卦损已益人的最高境界，因而使得损已益人的心意得到极大的满足。\n"],
"益卦":["初九，利用为大作，元吉，无咎。\n【白话】初九，利于大显身手干一番事业，如果能获得大吉大利，就不会遭到责难。\n《象》曰：“元吉无咎”，不厚事也。\n【白话】《象辞》说：“如果能获得大吉大利，就不会遭到责难”，表明在大显身手干事业的时候，一定要谨慎小心，尽量不要过分铺张奢侈，不能好大喜功而使民众过分辛劳。只有这样才能获大吉而免遭责难。\n",
"六二，或益之十朋之龟，弗克违，永贞吉；王用享于帝，吉。\n【白话】六二，有人送来价值昂贵的大乌龟，没有办法辞让，遇到这种情况，在任何时候占卜其结坚果永远是吉祥如意的；君王如果在此时祭祀天神，祈求降福保佑，也会如愿以偿获得吉利。\n《象》曰：“或益之”自外来也。\n【白话】《象辞》说：“有人送来（价值昂贵的大乌龟）”，这样的大好事并不是由于贪婪而主动索取的结果，完全是他人心甘情愿送上门来的意外收获。\n",
"六三，益之用凶事，无咎；有孚中行，告公用圭。(奇*书*网*.*整*理*提*供)\n【白话】六三，将所得到的好处用来帮助他人解除危难和灾祸，这样才不会引起麻烦；要满怀诚意地按照中庸之道行事，进见王公贵人时一定要手执象征虔诚守信的圭玉。\n《象》曰：益用凶事，固有之也。\n【白话】《象辞》说：将得到的好处用来解救他人的危难之事，是保全自身的最好办法。因为身处显赫地位，得到许多好处，同时也埋下了祸根，只有把这些好处用来助人，才能得人心，免除灾祸，从而可以牢固地保持所得到的好处。\n",
"六四，中行告公从，利用为依迁国。\n【白话】六四，采取温和宽厚的中庸态度行事，有事求告于王公的话，王公会很乐意的答应，此时最有利于借重王公的威望来决定迁徙国都这样的大事。\n《象》曰：“告公从”，以益志也。\n【白话】《象辞》说：“有事求告于王公的话，王公会很乐意地答应”并不是由于别的原因，完全是甘愿自我减损而使天下大众受益的志向感动了王公贵人。\n",
"九五，有孚惠心，勿问元吉：有孚惠我德。\n【白话】九五，满腹虔诚地怀着一颗使天下人受惠的仁慈之心，不用占卦问卜就知道是大吉大利：将心比心天下人必然也都虔诚地怀着施惠于我、感我恩德的心愿。\n《象》曰：“有孚惠心”，勿问之矣；惠我德，大得志也。\n【白话】《象辞》说：“满腹虔诚地怀着一颗使天下受惠的仁慈之心”，作为至高无上的君长，能够做到这样确实难能可贵，根本用不着占卦问卜，吉祥如意将永运伴随着他；天下人都虔诚地感激我的大恩大德，这种万民归心的盛况，使我自行减损造福大众的心志得到了极大的满足。\n",
"上九，莫益之，或击之；立心勿恒，凶。\n【白话】上九，没有谁来让他受益，倒是有人来攻击他；内心拿定主意却不能持之以恒，必然会有凶险临头。\n《象》曰：“莫益之”，偏辞也；“或击之”，自外来也。\n【白话】《象辞》说：“没有谁来让他受益”，是因为背离了益卦损己益人的宗旨，由损上益下变为损下益上，必然遭到世人的唾弃，他要求受益的呼声就只能是一厢情愿之辞；“倒是有人来攻击他”因为他凌驾于君王之上，位置不当，而且贪图受益，搞得天怒人怨，遭到外来的攻击也就毫不奇怪。\n"],
"夬卦":["初九，壮于前趾，往不胜为咎。\n【白话】初九，前面的脚趾粗壮，若急匆匆前去，不能完成制裁小人的使命，还会遇到灾祸。\n《象》曰：不胜而往，咎也。\n【白话】《象辞》说：初九爻地位最低下，本应该积蓄力量等待时机，却轻率急躁地前往，孤军深入只能遭到失败。不仅完不成制裁小人的使命，还会给自身带来灾祸。\n",
"九二，惕号，莫夜有戎，勿恤。\n【白话】九二，忽然听到惊叫声，深夜里小人来犯，用不着担忧。\n《象》曰：“有戎勿恤”，得中道也。\n【白话】《象辞》说：“深夜小人来犯，用不着担忧”，这是因为九二爻处在下卦的中位，能够信守中庸之道，尽管遭到小人的骚扰，终究是有惊无险，可以化险为夷。\n",
"九三，壮于頄，有凶；君子夬夬独行，遇雨若濡，有愠，无咎。\n【白话】九三，颧骨高突怒容满面，去与小人较量必然有凶险；若是以君子气度毅然决然地前去，即使遇上大雨浑身湿透而心怀恼怒，却不会有任何灾祸。\n《象》曰：“君子夬夬”，终无咎也。\n【白话】《象辞》说：“若是君子气度毅然决然地前去”，不露声色地与小人周旋，就能够避免打草惊蛇引起不测，又可斩断感情纠葛，避免优柔寡断，因而不会遇到灾祸。\n",
"九四，臀无肤，其行次且；牵羊悔亡，闻言不信。\n【白话】九四，屁股上蹭破了皮，前去制裁小人的行程必然步履维艰；若是紧紧牵着羊（象征阳刚）行走，就不会出现令人后悔的事，无奈听了这话的人并不相信。\n《象》曰：“其行次且”，位不当也；“闻言不信”，聪不明也。\n【白话】《象辞》说：“前去制裁小人的行程必然步履维艰”，是因为所处位置失当，处处受到君王的掣肘，好像屁股蹭破了皮，走起路来十分艰难。“无奈听了这话的人并不相信”，说明处境艰难，别人建议他借重强有利的阳刚君子的帮助，他却听不进去，听觉正常而决断不明。\n",
"九五，苋陆夬夬，中行无咎。\n【白话】九五，毅然决然地做出决断，一举惩处小人就像铲除苋陆草一样，只要注意时时信守中庸之道，就不会遇到灾祸。\n《象》曰：“中行无咎”，中未光也。\n【白话】《象辞》说：“只要注意时时信守中庸之道，就不会遇到灾祸”，表明尽管处在尊贵地位，要解决小人为乱易如反掌，却也不能做得太过分，要恰到好处才能避免灾祸。这也说明坚守正道的举动并未大放光彩，仅仅起到免除祸殃的作用而已。\n",
"上六，无号，终有凶。\n【白话】上六，嚎啕大哭也没有用，最终必然有凶险临头。\n《象》曰：“晚号之凶”，终不可长也。\n【白话】《象辞》说：“嚎啕大哭也没有用，最终必然有凶险临头”，表明上六以阴柔小人凌驾于阳刚君子特别是君王之上，是众矢之的。其倒行逆施的状况不会持续很长时间，最终难以逃脱被制裁的命运。\n"],
"姤卦":["初六，系于金柅，贞吉；有攸往，见凶，赢豕孚蹢躅。\n【白话】初六，绑上坚固结实的车闸，占卜结果会很吉祥；前去行事，会遇到凶险，瘦弱的猪因烦躁而团团乱转。\n《象》曰：“系于金柅”，柔道牵也。\n【白话】《象辞》说：“绑上坚固结实的车闸”，紧急关头就可以使车轮与车闸“相遇”，而使狂奔的车子刹住。引伸为遇到强硬的对手，不要去硬碰，应该用柔韧的手段牵制对手，达到以柔克刚的效果。\n",
"九二，包有鱼，无咎；不利宾。\n【白话】九二，厨房里发现鱼，不会有灾祸；但不利于拿来宴请宾客。\n《象》曰：“包有鱼”，义不及宾也。\n【白话】《象辞》说：“厨房里发现鱼”，还不会出现灾祸，但不宜用鱼来宴宾。因为不义之财不可取。\n",
"九三，臀无肤，其行次且；厉，无大咎。\n【白话】九三，屁股上蹭破了皮，走起路来很困难；会遇到危险，但不会有大的灾祸。\n《象》曰：“其行次且”，行未牵也。\n【白话】《象辞》说：“走起路来很困难”，表明在路上会遇到艰险，但尽管艰难，却并未完全受到牵制，还可以继续前进。\n",
"九四，包无鱼，起凶。\n【白话】九四，厨房里没有鱼，会发生凶险。\n《象》曰：无鱼之凶，远民也。\n【白话】《象辞》说：厨房里没有鱼而引起凶险，就好像君主失去民众百姓的支持，因为脱离民众，当然会发生凶险。\n",
"九五，以杞包瓜，含章，有陨自天。\n【白话】九五，用杞树枝叶包住甜瓜，好比内心怀着美好的品德，不必奔忙，称心的机遇就会自天而降。\n《象》曰：九五含章，中正也；有陨自天，志不舍命也。\n【白话】《象辞》说：《姤卦》的第五爻位（九五）内心怀着美好的品德，表明尽管处在最尊贵的地位，却能够坚守中道，心地纯正。这样一来，其相遇的情形也是最完美的，用不着上下奔忙，就能与上天恩赐的福佑相遇。充分说明只要不违天命，就能有好的遇合。\n",
"上九，姤其角；吝，无咎。\n【白话】上九，头上长角，处境艰难，不过也不会有大的灾祸。\n《象》曰：“姤其角”，上穷吝也。\n【白话】《象辞》说：“头上长角”，孤芳自赏，根本不会有志同道合的伙伴与之相遇，而失去大众的支持，等待着的只有困穷不通的命运。\n"],
"萃卦":["初六，有孚不终，乃乱乃萃；若号，一握为笑；勿恤，往无咎。\n【白话】初六，如果对神灵的一片诚心不能始终如一，各种乱子就会发生而凑到一起；众人喧哗呼号，只要彼此握手交流感情，就能化众怒为欢笑；用不着忧虑，前去行事不会遇到灾祸。\n《象》曰：“乃乱乃萃”，其志乱也。\n【白话】《象辞》说：“各种乱子就会发生而凑到一起”，不是由于别的原因，主要是因为内心的虔诚不能始终如一，陷于迷惑混乱所致。\n",
"六二，引吉，无咎；孚乃利用禴。\n【白话】六二，引退谦让会带来吉祥，没有害处；只要内心怀着虔诚，即使举行微薄的禴祭（即春祭，古代四季祭祀之一）也能带来吉祥。\n《象》曰：“引吉无咎”中未变也。\n【白话】《象辞》说：“引退谦让会带来吉祥，没有灾难”，这是因为该爻位置居中而适当，当会聚的时候，它既不偏不激也不过于保守，虔诚地遵循中庸之道始终不曾改变，因而能够谦让而逢凶化吉。\n",
"六三，萃如嗟如，无攸利；往无咎，小吝。\n【白话】六三，聚合的希望在叹息声中破灭，干什么都不会顺利；前去行事不会遇到灾祸，只有一点小小麻烦。\n《象》曰：“往无咎”，上巽也。\n【白话】《象辞》说：“前去行事不会遇到灾祸”这是因为遇到居于上位的阳刚气十足者。但居于下方的阴柔一方总能表现出谦逊而顺从，从而免去了可能出现的灾祸。\n",
"九四，大吉，无咎。\n【白话】九四，只有在大吉大利的情况下，才能够没有灾祸。\n《象》曰：“大吉无咎”，位不当也。\n【白话】《象辞》说：“只有在大吉大利的情况下，才能够没有灾害”，这是因为所处位置不适当，随时有可能受到伤害，只有在大吉大利的时候才可以避免受害。\n",
"九五，萃有位，无咎，匪孚；元永贞；悔亡。\n【白话】九五，当万方聚合之时居于尊贵的高位，不会遇到灾难，但也并没有取得大众的主悦诚服；德高望重的君长如果能坚定不移地主持正义，倡导纯正的风尚，就可以避免因做错事而引起的后悔。\n《象》曰：“萃有位”，志未光也。\n【白话】《象辞》说：“万方聚合之时居于尊贵的高位”，并不能表明大会天下、四海归心的志向得到了发扬光大，还需要修持德行，树立威望，使大众心悦诚服。\n",
"上六，齐咨涕洟，无咎。\n【白话】上六，唉声叹气而又哭哭啼啼，不会遇到灾祸。\n《象》曰：“齐咨涕洟”，未安上也。\n【白话】《象辞》说：“唉声叹气而又哭哭啼啼”，是因为虽然身在外，但无一日惦念处于京中的君主。"],
"升卦":["初六，允升，大吉。\n【白话】初六，宜于上升，大吉大利。\n《象》曰：“允升大吉”上合志也。\n【白话】《象辞》说：“宜于上升而大吉大利”，是因为阴柔处在最卑下的地位，位于其上的阳刚者同情其处境，希望其尽快上升，所以其上正合乎上面的意思。\n",
"九二，孚乃利用禴，无咎。\n【白话】九二，内心恭敬虔诚，即使微薄的禴祭也可以感动神灵，免除灾祸。\n《象》曰：九二之孚，有喜也。\n【白话】《象辞》说：《升卦》的第二爻位（九二）内心虔诚仁厚，一心成人之美，深得众人信服，必定会给自身带来喜庆。\n",
"九三，升虚邑。\n【白话】九三，上升到空旷的城邑，如入无人之境。\n《象》曰：“升虚邑”，无所疑也。\n【白话】《象辞》说：“上升到空旷的城邑”，这是因为没有任何阻碍，上升得十分顺利，不要有半点迟疑。\n",
"六四，王用亨于岐山，吉，无咎。\n【白话】六四，君王到岐山祭祀神灵，吉祥如意，没有灾祸。\n《象》曰：“王用亨于岐山”，顺事也。\n【白话】《象辞》说：“君王到岐山祭祀神灵”，就是向神灵表示恭顺，诚惶诚恐地供奉神灵，结果必然会带来吉祥如意。\n",
"六五，贞吉，升阶。\n【白话】六五，占卜结果吉祥如意，乘势沿着台阶稳步上升。\n《象》曰：“贞吉升阶”，大得志也。\n【白话】《象辞》说：“占卜结果吉祥如意，乘势沿着台阶稳步上长”，表明上升已达到鼎盛时期，接近光辉的顶点。真可说得上是春风得意，踌躇满志。同时也表明阴柔居于尊位，必须稳健行事，循序渐进，不可像“升虚邑”那样冒进。\n",
"上六，冥升，利于不息之贞。\n【白话】上六，在昏暗幽冥状态下依然上升，只有坚持不懈地保持纯正品性，才能获得好的结果。\n《象》曰：冥升在上，消不富也。\n【白话】《象辞》说：昏暗幽冥状态下仍然上升，本身又已处在《升卦》的最高位置，按照盛极而衰的道理，上升的势头必然会逐渐消退，再不会如原来那样富有进取精神了。\n"],
"困卦":["初六，臀困于株木，入于幽谷，三岁不觌。\n【白话】初六，屁股卡在木桩上坐立不安，退隐到幽深的山谷里，三年不与外人相见。\n《象》曰：“入于幽谷”，幽不明也。\n【白话】《象辞》说：“退隐到幽深的山谷里”，就是进入荒僻阴暗不见天日的地方，比喻处境极其困难，看不到一线希望。\n",
"九二，困于酒食，朱绂方来，利用享祀；征凶，无咎。\n【白话】九二，为醇酒美食所困扰而穷于应付，高官厚禄就将来到，应当用丰美的酒食祭祀神灵；出兵征战即使遇到凶险，也不会受到伤害。\n《象》曰：“困于酒食”，中有庆也。\n【白话】《象辞》说：“为醇酒美食所困扰而穷于应付”，并不是很可怕的事，只要内心坚持中道，纯正而有主见，就会有喜庆之事到来。\n",
"六三，困于石，据于蒺藜；入于其宫，不见其妻，凶。\n【白话】六三，困在石头下面，站在蒺藜之上；刚刚回到家中，又不见了自家妻室，凶险接二连三来到身边。\n《象》曰：“据于蒺藜”，乘刚也；“入于其宫，不见其妻”，不祥也。\n【白话】《象辞》说：“站在蒺藜之上”，就是说阴柔凌驾在阳刚之上，情形就像是站在刺人的蒺藜上面，十分困窘。“刚刚回到家中，又不见了自家妻室”，说明祸不单行，已经饱受各种困扰，家门又惨遭不幸，实在是不吉祥的兆头。\n",
"九四，来徐徐，困于金车，吝，有终。\n【白话】九四，慢腾腾姗姗来迟，原来是被一辆豪华金车所困而不能脱身，会遇到一些困难，但最终会有好的结局。\n《象》曰：“来徐徐”，志在下也；虽不当位，有与也。\n【白话】《象辞》说：“慢腾腾姗姗来迟”，表明没有飞黄腾达的奢望，一心想着屈尊下士来摆脱困境；虽然所处地位不妥当，不能胜任职务，却能得到志同道合者的支持。\n",
"九五，劓刖，困于赤绂；乃徐有说，利用祭祀。\n【白话】九五，用割鼻子剁脚的酷刑治理天下，就会被自身所处的尊贵地位所困扰；但慢慢地又会走出困境，应当虔诚地祭祀神灵，才能保证前景顺利。\n《象》曰：“劓刖”，志未得也；“乃徐有说”，以中直也；“利用祭祀”，受福也。\n【白话】《象辞》说：“用割鼻子剁脚的酷刑治理天下”，表明处在至高无上的显赫位置上，如果不恤民命，滥施酷刑，就会落得个孤家寡人，被困在众叛亲离的尊位上，摆脱困境走向亨通的志向就难以实现。“慢慢地又会走困境”，完全是由于坚守中庸、保持正直品德的结果；“应当虔诚地祭祀神灵，才能保证前景顺利”，就是说诚心敬神，可以时时接受神灵恩赐的福分，求得吉祥顺利。\n",
"上六，困于葛藟，于臲曚；曰动悔有悔，征吉。\n【白话】上六，困在纷乱缠绕的葛藤中，身临摇摇欲坠的山石之间，假如说动辄会后悔，那就早点行动，让悔悟快点到来，向前进军会迎来吉祥。\n《象》曰：“困于葛藟”，未当也；“动悔有悔”，吉行也。\n【白话】《象辞》说：“困在纷乱缠绕的葛藤中”，说明所处位置不是十分妥当，脚下尚有难以解脱的绊索，因此困难重重。“假如说动辄会后悔，那就早点行动，让悔悟快点到来”，这是十分明智的举动，早些悔悟，把危险抛在身后，前途就会无比吉祥顺利。\n"],
"井卦":["初六，井泥不食，旧井无禽。\n【白话】初六，井底淤满了污泥不能供人饮用，历尽沧桑，年久失修的老井连鸟雀都不来光顾。\n《象》曰：“井泥不食”，下也；“旧井无禽”，时舍也。\n【白话】《象辞》说：“井底淤满了污泥不能供人饮用”，完全是因为位置处在最下面，相当于井底部位，水中泥沙不断沉淀最后都淤积在这里；“历尽沧桑、年久失修的老井连鸟雀都不来光顾”，反映出一种时过境迁，被世间万物所遗忘抛弃的凄凉遭遇。\n",
"九二，井谷射鲋，瓮敝漏。\n【白话】九二，井底容水的凹穴被当作捉鱼的场所，汲水的瓮也破损漏水不能再用。\n《象》曰：“井谷射鲋”，无与也。\n【白话】《象辞》说：“井底容水的凹穴被当作捉鱼的场所”，主要是由于上面没有接应，难以把水送到地面上去供人饮用。于是井的作用得不到发挥，只好退而求其次，盛水的地方成了抓鱼的所在。由于水井陷于瘫痪状态，因而汲水的器具也破损不堪用不成了。\n",
"九三，井渫不食，为我心恻；可用汲，王明并受其福。\n【白话】九三，井水淘干净了却不饮用，使我心中不免失望；可以赶快汲来尽情享用，君王贤明是大家共同的福气。\n《象》曰：“井渫不食”，行恻也；求“王明”，受福也。\n【白话】《象辞》说：“井水淘干净了却不饮用”，表明尽管血气方刚，一心想有所作为而使世人受益，却苦于一片好心无人领受，满怀热情的善行只落了个令人悲叹的结局；希望“君王贤明”，直接从井水说到人事，盼望圣明的君主出现，思贤若渴，像汲水一样选拔吸收重用人才，就能给国家带来吉祥，君臣万民都可以享受到由此带来的恩惠。\n",
"六四，井甃，无咎。\n【白话】六四，用砖石垒砌加固井壁，不会遇到灾祸。\n《象》曰：“井甃无咎”，修井也。\n【白话】《象辞》说：“用砖石垒砌加固井壁，不会遇到灾祸”，表明六四爻以阴柔之象处在《井卦》居中部位，正好相当于井壁的关键部位，不可有丝毫闪失。因此应当及时修缮使其坚固，才能免除灾祸。\n",
"九五，井洌，寒泉食。\n【白话】九五，井水清澈明净，就像甘甜凉爽的泉水一样可供天下人饮用。\n《象》曰：“寒泉之食”，中正也。\n【白话】《象辞》说：“像甘甜凉爽的泉水一样可供天下人饮用”，这是因为九五爻处在最尊贵的地位，位置适中而且十分妥当。象征行为不偏不倚，内心纯正无私。因而能够集中体现水井滋润万物，造福大众的美德。\n",
"上六，井收，勿幕；有孚，元吉。\n【白话】上六，水井养人润物的功德业已完成，不要盖上井口；内心怀着一片诚意，定能带来大吉大利。\n《象》曰：“元吉”在上，大成也。\n【白话】《象辞》说：“大吉大利”的情况出现在《井卦》最上面的位置，是因为上下照应，同心协力可将水提出井口。而且在这以后并不把井口盖严，继续怀着诚心为人们不断提供饮水的方便，功德无量，必然会有大吉大利到来。从而标志着滋养世人的宏伟事业获得了巨大的成功。\n"],
"革卦":["初九，巩用黄牛之革。\n【白话】初九，应该用黄牛的皮革牢牢地捆绑住。\n《象》曰：“巩用黄牛”，不可以有为也。\n【白话】《象辞》说：“用黄牛的皮革牢牢地捆绑住”，因为初九在卦的最下位，位卑微而不可能有所作为。\n",
"六二，己日乃革之，征吉，无咎。\n【白话】六二，在己日进行变革，前途必获吉祥，不会有灾祸。\n《象》曰：“己日革之”，行有佳也。\n【白话】《象辞》说：“在己日进行变革”，必然会有好的功效。\n",
"九三，征凶，贞厉；革言三就，有孚。\n【白话】九三，急进会发生凶险，要以正防危；对于变革的言论，要多次研究周密考虑，赢得人们的信赖，就可以进行变革了。\n《象》曰：“革言三就”，又何之矣！\n【白话】《象辞》说：“对于变革的言论，要多次研究周密考虑”，其他的路是没有的，变革已经势在必行，只有走变革的道路。\n",
"九四，悔亡，有孚改命，吉。\n【白话】九四，悔恨已经消释，仍旧需要人们的信赖以革除旧的事物，这样做是吉祥的。\n《象》曰：改命之吉，信志也。\n【白话】《象辞》说：革除旧的事物，这样做是吉祥的，因为这符合变革的志向。\n",
"九五，大人虎变，未占有孚。\n【白话】九五，伟大的人物像猛虎一般进行变革，不必置疑一定能光大诚信的美德。\n《象》曰：“大人虎变”，其文炳也。\n【白话】《象辞》说：“伟大的人物像猛虎一般进行变革”，表明变革必然成功，其美德光照天下。\n",
"上六，君子豹变，小人革面；征凶，居贞吉。\n【白话】上六，君子像有斑纹的豹子那样进行变革，连小人也顺应变革改变旧日倾向；急进会有凶险，居而守正可以得到吉祥。\n《象》曰：“君子豹变”，其文蔚也；“小人革面”，顺以从君也。\n【白话】《象辞》说：“君子像有斑纹的豹子那样进行变革”，说明君子协助有道德的大人物一起变革，必然使变革的成就更加光辉灿烂；“连小人也顺应变革改变旧日倾向”，说明大势所趋，小人也不得不顺从君子的变革。\n"],
"鼎卦":["初六，鼎颠趾，利出否；得妾以其子无咎。\n【白话】初六，烹饪食物的鼎足颠翻，却顺利地倒出了鼎中陈积的污秽之物；就好像娶妾可以生子一样，不会发生灾祸。\n《象》曰：“鼎颠趾”，未悖也；“利出否”，以从贵也。\n【白话】《象辞》说：“烹饪食物的鼎足颠翻”，看似反常，实则不然；“却顺利地倒出了鼎中陈积的污秽之物”，便于除旧布新，反常的现象得以向好的方面转化。\n",
"九二，鼎有实；我仇有疾，不我能即，吉。\n【白话】九二，鼎中盛满了烹饪的食物，好比一个人有才干；我的对立面嫉妒我，却不能把我怎么样，是吉祥的。\n《象》曰：“鼎有实”，慎所之也；“我仇有疾”，终无尤也。\n【白话】《象辞》说：“鼎中盛满了烹饪的食物，好比人有才干”，应该谨慎行事，不要走错方向；“我的对立面嫉妒我”，但因无隙可乘，故终将无所怨尤。\n",
"九三，鼎耳革，其行塞，雉膏不食；方雨亏悔，终吉。\n【白话】九三，鼎器的耳部发生了变化，无法将插杠插入鼎耳移鼎，精美的野鸡肉不能得到无法食用；待到阴阳调和，润雨出现才能消释悔恨，最终还可以获得吉祥。\n《象》曰：“鼎耳革”，失其义也。\n【白话】《象辞》说：“鼎器的耳部发生了变化”，鼎无法移动，也就失去了它虚中纳物的意义。\n",
"九四，鼎折足，覆公诉，其形渥，凶。\n【白话】九四，鼎的足折断了，王公鼎里的粥饭倾倒出来了，鼎身被玷污，凶险。\n《象》曰：“覆公诉”，信如何也！\n【白话】《象辞》说：“王公鼎里的粥饭倾倒出来了”，哪里还有什么信誉可言呢！\n",
"\n六五，鼎黄耳金铉，利贞。\n【白话】六五，鼎配上黄色的鼎耳，插上坚固的扛鼎之器，利于坚守正道。\n《象》曰：“鼎黄耳”中以为实也。\n【白话】《象辞》说：“鼎配上黄色的鼎耳”，是由于六五爻居中，自然可获得实惠。\n",
"上九，鼎玉铉，大吉，无不利。\n【白话】上九，鼎配上玉制的鼎杠，十分吉祥，不会有什么不利。\n《象》曰：玉铉在上，刚柔节也。\n【白话】《象辞》说：玉制的鼎杠高处上方，表明刚柔相济，互相调节。\n"],
"震卦":["初九，震来虩；虩，后笑言哑哑；吉。\n【白话】初九，当惊雷震动的时候，天下万物都感到恐惧，君子亦应知恐惧而修省；当惊雷震动的时候，君子亦应言笑自若，结果是吉祥的。\n《象》曰：“震来虩虩”，恐致福也；“笑言哑哑”，后有则也。\n【白话】《象辞》说：“当惊雷震动的时候，天下万物都感到恐惧”，表明恐惧之后从而谨慎从事，能够致福；“而君子却能安之若素，言笑如故”，说明君子懂得做人的法则。\n",
"六二，震来，厉；亿丧贝，跻于九陵，勿逐，七日得。\n【白话】六二，惊雷震动，有危难；丢失大量金钱，应当攀登到高高的九陵上边去躲避，不去追寻它，待到七天自会失而复得。\n《象》曰：“震来厉”，乘刚也。\n【白话】《象辞》说：“惊雷震动，有危难”，六二爻凌驾于初九爻阳刚的上面，故可能出现危险。\n",
"六三，震苏苏，震行无眚。\n【白话】六三，雷震动时虽恐惧不安，但是因为震惧而能谨慎行事，因此不会有灾异。\n《象》曰：“震苏苏”，位不当也。\n【白话】《象辞》说：“雷震动恐惧不安”，说明六三爻所处的位置，不中不正，不适当。\n",
"九四，震遂泥。\n【白话】九四，由于雷震动而坠陷泥污中，不能自拔。\n《象》曰：“震遂泥”，未光也。\n【白话】《象辞》说：“由于雷震动而坠陷泥污中，不能自拔”，说明其志气不能发扬光大。\n",
"六五，震往来，厉；亿无丧，有事。\n【白话】六五，雷上下震动均有危难；以恐惧之心谨守中道就会万无一失，宗庙社稷也可以长盛不衰。\n《象》曰：“震往来厉”，危行也；其事在中，大无丧也。\n【白话】《象辞》说：“雷上下震动均有危难”，但能知恐惧而谨慎行动；处事恪守中道，就不会有什么大的损失。\n",
"上六，震索索，视矍矍，征凶；震不于其躬，于其邻，无咎；婚媾有言。\n【白话】上六，由于雷震动恐惧而畏缩不前，两眼旁视而不安，如果行动就会有凶险；不过，当雷震还没有到达自己身上时，就早作戎备谨慎行事，则不致受害；涉及婚配之事则将会产生言语纷争。\n《象》曰：“震索索”，中未得也；虽凶无咎，畏邻戎也。\n【白话】《象辞》说：“由于雷震动恐惧而畏缩不前”，因为上六爻其位不正；虽然有凶险却不致受害，这是因为能够看见近邻的危险及时戎备，因而能防患于未然。\n"],
"艮卦":["初六，艮其趾，无咎，利永贞。\n【白话】初六，抑止应该在脚趾迈出之前，这样就不会受害，而且将有利于长久坚守正道。\n《象》曰：“艮其趾”未失正也。\n【白话】《象辞》说：“抑止应该在脚趾迈出之前”，这就说明没有失去正道。\n",
"六二，艮其腓，不拯其随，其心不快。\n【白话】六二，抑止人的小腿的行动，不能迈步追随应该追随的人，他的心中是不会快乐的。\n《象》曰：“不拯其随”，未退听也。\n【白话】《象辞》说：“不能迈步追随应该追随的人”，又不能退下来听从抑止的意见，因而心中不快。\n",
"九三，艮其限，列其夤，厉薰心。\n【白话】九三，抑止腰部的行动，断裂脊背的肉，危难将像熊熊的烈火一样烧灼他的心。\n《象》曰：“艮其限”，危薰心也。\n【白话】《象辞》说：“抑止腰部的行动”，说明危险将像熊熊的烈火一样烧灼他的心。",
"六四，艮其身，无咎。\n【白话】六四，抑止身体上部不动，就不会受害。\n《象》曰：“艮其身”，止诸躬也。\n【白话】《象辞》说：“抑止身体上部不动”，自我控制不超越本身的地位。\n",
"六五，艮其辅，言有序，悔亡。\n【白话】六五，抑止于口不随便乱说，说话很有条理，悔恨将会消失。\n《象》曰：“艮其辅”，以中正也。\n【白话】《象辞》说：“抑止于口不随便乱说”，说明六五爻居于中位能守中道。\n",
"上九，敦艮，吉。\n【白话】上九，能够以敦厚笃实的德行抑止邪欲，就吉祥。\n《象》曰：“敦艮之吉”，以厚终也。\n【白话】《象辞》说：“能够以敦厚笃实的德行抑止邪欲，就吉祥”，说明上九能够将敦厚的德行保持至终。"],
"渐卦":["初六，鸿渐于干；小子厉，有言，无咎。\n【白话】初六，鸿雁飞起来逐渐前进到水涯旁边，落伍离群，显得不安；象征着年幼无知的孩子有危难，受到言语中伤，如果能够循序渐进，就不会受害。\n《象》曰：“小子之厉”，义无咎也。\n【白话】《象辞》说：“年幼无知的孩子有危难”，不会发生什么危险的。\n",
"六二，鸿渐于磐，饮食衎衎，吉。\n【白话】六二，鸿雁飞起来逐渐前进到安稳的磐石之上，饮食和乐，吉祥。\n《象》曰：“饮食衎衎”，不素饱也。\n【白话】《象辞》说：“饮食和乐”，说明决不是尸位素餐不干事情的。",
"九三，鸿渐于陆，夫征不复，妇孕不育，凶；利御寇。\n【白话】九三，鸿雁飞起来逐渐前进到较平的山顶，好比丈夫远去出征而不复还，他的妻子非夫而孕难以生育，这当然是凶险的事；但却能以刚烈御强寇。\n《象》曰：“夫征不复”，离群丑也；“妇孕不育”，失其道也；“利用御寇”，顺相保也。\n【白话】《象辞》说：“好比丈夫远去出征而不复还”，离开自己的同类是值得忧虑的；“他的妻子非夫而孕难以生育”，因为违反了妇道；“但却能以刚烈御强寇”说明守正能够使丈夫与妻子和顺相保。\n",
"六四，鸿渐于木，或得其桷，无咎。\n【白话】六四，鸿雁飞起来逐渐前进到高树之上，或许能找到较平的枝杈得以栖息，这样就没有愆尤。\n《象》曰：“或得其桷”，顺以巽也。\n【白话】《象辞》说：“或许能寻找到较平的枝杈得以栖息”，说明六四柔顺和服从。\n",
"九五，鸿渐于陵，妇三岁不孕；终莫之胜，吉。\n【白话】九五，鸿雁飞起来逐渐前进到丘陵上，好比丈夫远出在外，妻子三年没有怀孕；但邪毕竟不能胜正，因此最终得到吉祥。\n《象》曰：“终莫之胜吉”，得所愿也。\n【白话】《象辞》说：“邪终久不能胜正，因此就得到吉祥”，实现了夫妇聚首的愿望。\n",
"上九，鸿渐于陆，其羽可用为仪，吉。\n【白话】上九，鸿雁飞起来逐渐前进到高山之上，漂亮的羽毛可以作为典礼上洁美的装饰品，吉祥。\n《象》曰：“其羽可用为仪，吉”，不可乱也。\n【白话】《象辞》说：“洪亮的羽毛可以作为典礼上洁美的装饰品，吉祥”，说明洁美高尚的志向不能相乱的。\n"],
"归妹":["初九，归妹以娣，跛能履，征吉。\n【白话】初九，嫁出的少女作为偏房，好像跛脚而奋力向前行走，前进可获得吉祥。\n《象》曰：“归妹以娣”，以恒也；跛能履，吉相承也。\n【白话】《象辞》说：“嫁出的少女作为偏房”，这是婚嫁中的正常情况；“好像跛脚而奋力向前行走”，说明能以偏房侧室的地位辅佐和照顾丈夫，必获吉祥。\n",
"九二，眇能视，利幽人之贞。\n【白话】九二，眼睛一瞎一明仍能看到东西，说明幽居之人利于守正。\n《象》曰：“利幽人之贞”，未变常也。\n【白话】《象辞》说“幽居之人利于守正”，这是因为能遵守恒常的",
"六三，归妹以须，反归以娣。\n【白话】六三，妹妹想冒充姐姐之位嫁为正室，结果还是作为妹妹嫁做偏房。\n《象》曰：“归妹以须”，未当也。\n【白话】《象辞》说：“妹妹想冒充姐姐的地位嫁为正室”，这是不正当的。\n",
"九四，归妹愆期，迟归有时。\n【白话】九四，待嫁少女错过出嫁的时机，延迟日期待嫁，静等好的时机。\n《象》曰：愆期之志，有待而行也。\n【白话】《象辞》说：错过出嫁的时机，是为等待更好的时机到来再嫁。\n",
"六五，帝乙归妹，其君之袂，不如其娣之袂良；月几望，吉。\n【白话】六五，帝乙嫁出少女，正房的服饰，反不如偏房的服饰艳丽华美；月近十五将要圆了，吉祥。\n《象》曰：“帝乙归妹，不如其娣之袂良”也；其位在中，以贵行也。\n【白话】《象辞》说：“帝乙嫁出少女，正房的服饰，反不如偏房的服饰艳丽华美”；说明虽身居中位，十分尊贵，却能保持勤俭谦虚的美德。\n",
"上六，女承筐，无实，士刲羊，无血。无攸利。\n【白话】上六，女子的筐篮里空空荡荡没有实物，男子用刀宰羊却不见出血。没有利益。\n《象》曰：上六无实，承虚筐也。\n【白话】《象辞》说：《归妹卦》的第六位（上六）空虚无实，好比手持空空的篮筐。\n"],
"丰卦":["初九，遇其配主，虽旬无咎，往有尚。\n【白话】初九，遇见地位彼此相当的伙伴，虽然合作十天也不致受害，前往会受到尊敬重视。\n《象》曰：“虽旬无咎”，过旬灾也。\n【白话】《象辞》说：“虽然合作十天也不致受害”，但是过了十天就可能会有灾祸。\n",
"六二，丰其蔀，日见斗，往得疑疾；有孚发若，吉。\n【白话】六二，光明遭到云的蒙蔽，好比明亮的白天却看到了夜晚的北斗星，前往行事会被猜疑；如果能以自己的至诚之心去启迪，那么最后是能获得吉祥的。\n《象》曰：“有孚发若”，信以发志也。\n【白话】《象辞》说：“能以自己的至诚之心去启迪”，是有信以展拓其盛大之志。\n",
"九三，丰其沛，日中见沬；折其右肱，无咎。\n【白话】九三，光明被云遮掩，明亮的白天看见了小星星；好比右臂被折断而难以有所作为，但终究不会受害。\n《象》曰：“丰其沛”，不可大事也；“折其右胘”，终不可用也。\n【白话】《象辞》说：“光明被云遮掩”，不可成就胜任大事；“右臂折断而无为慎守”，最终得不到重用或不可能有所作用了。\n",
"九三，丰其沛，日中见沬；折其右肱，无咎。\n【白话】九三，光明被云遮掩，明亮的白天看见了小星星；好比右臂被折断而难以有所作为，但终究不会受害。\n《象》曰：“丰其沛”，不可大事也；“折其右胘”，终不可用也。\n【白话】《象辞》说：“光明被云遮掩”，不可成就胜任大事；“右臂折断而无为慎守”，最终得不到重用或不可能有所作用了。\n",
"六五，来章，有庆誉，吉。\n【白话】六五，有美德的贤能之士来辅佐，会有喜庆和美誉，吉祥。\n《象》曰：六五之吉，有庆也。\n【白话】《象辞》说：《丰卦》的第五爻位（六五）的吉祥，必定会有喜庆。\n",
"上六，丰其屋，蔀其家，闚其户，阒其无人，三岁不觌，凶。\n【白话】上六，房屋高大，蒙蔽居室，窥视窗户，寂静而无人，三年之久仍不见人，自蔽孤立，定有凶险。\n《象》曰：“丰其屋”，天际翔也；“闚其户，阒其无人”，自藏也。\n【白话】《象辞》说：“高大的房屋”，居内自蔽，孤立于人，好似在天际飞翔；“窥视窗户，寂静而无人”，深深隐藏踪迹。\n"],
"旅卦":["初六，旅琐琐，斯其所取灾。\n【白话】初六，旅行之始猥琐不堪，这是自己招来的灾祸。\n《象》曰：“旅琐琐”，志穷灾也。\n【白话】《象辞》说：“旅行之始猥琐不堪”，是意志穷迫造成的灾祸。\n",
"六二，旅即次，怀其资，得童仆，贞。\n【白话】六二，旅客住在旅舍，携带钱财，有童仆照顾，能坚守正道。\n《象》曰：“得童仆贞”，终无尤也。\n【白话】《象辞》说：“有童仆照顾，能坚守正道”，故不会有过失。",
"九三，旅焚其次，丧其童仆；贞厉。\n【白话】九三，旅途中施舍失火，从而丧失了照顾自己的童仆，失去正道，会出现危险。\n《象》曰：“旅焚其次”，亦以伤矣；以旅与下，其义丧也。\n【白话】《象辞》说：“旅途中施舍失火”，已经受到损伤；把童仆视为路人，童仆舍其而去，是必然的，合乎道理的。\n",
"九四，旅于处，得其资斧，我心不快。\n【白话】九四，身处异乡暂为栖身，不能安居，虽然得到路费，但我的心情仍然不愉快。\n《象》曰：“旅于处”，未得位也；“得其资斧”，心未快也。\n【白话】《象辞》说：“身处异乡暂为栖身，不能安居”，因为毕竟未得到长久安身的地方；“虽然得到路费”，但仍然客居他乡，故此时心中仍不畅快。\n",
"六五，射雉，一矢亡；终以誉命。\n【白话】六五，射野鸡，丧失一枝箭；但最终获得荣誉和爵命。\n《象》曰：“终以誉命”，上逮也。\n【白话】《象辞》说：“最终获得荣誉和爵命”，是由于能亲近居高位的尊者。\n",
"上九，鸟焚其巢，旅人先笑，后号咷；丧牛于易，凶。\n【白话】上九，鸟巢失火被烧掉，行旅之人得高位先喜悦欢笑，后因遭祸事而号啕痛哭；牧人在牧场丢失了牛，有凶险。\n《象》曰：以旅在上，其义焚也；丧牛于易，终莫之闻也。\n【白话】《象辞》说：作为旅客却在异乡身居高位，这样必然要遭到焚巢之灾；牧人在牧场丢失了牛，这个，可悲的结局是无可挽回的。\n"],
"巽卦":["初六，进退，利武人之贞。\n【白话】初六，过度谦卑，缺乏信心，进退迟疑，利于勇武之人坚守中正之道。\n《象》曰：“进退”志疑也；“利武人之贞”，志治也。\n【白话】《象辞》说：“过度谦卑，缺乏信心，进退迟疑”，是指意志懦弱犹豫；“利于勇武之人坚守中道”，是勉励其修治，以树立坚强的意志。\n",
"九二，巽在床下，用史、巫纷若吉，无咎。\n【白话】九二，过度谦卑而屈居于床下，如果能像祝史、巫觋那样用崇敬谦恭的态度事神将十分吉祥，一定不会有什么祸患。\n《象》曰：“纷若之吉”，得中也。\n【白话】《象辞》说：“用崇敬谦恭的态度去行事将十分吉祥”，这是因为九二爻能够居中守正的缘故。\n",
"九三，频巽，吝。\n【白话】朝令夕改，使人无所适从，会有祸患。\n《象》曰：“频巽之吝”，志穷也。\n【白话】《象辞》说：“朝令夕改，使人无所适从，会有祸患”，是因为当政者缺乏远大的志向。\n",
"六四，悔亡，田获三品。\n【白话】六四，悔恨消失，田猎时得到多种收获。\n《象》曰：“田获三品”，有功也。\n【白话】《象辞》说：“田猎时得到多种收获”，是因为能恪守“顺从”之道，所以才有所建树。\n",
"九五，贞吉，悔亡，无不利；无初有终；先庚三日，后庚三日，吉。\n【白话】九五，坚守中道，可以得到吉祥，悔恨会消失，做任何事情没有不顺利的；开始时也许不会太顺利，但最后一定会通达。比如颁行新的法令、政令，可以在象征变更的“庚”日的前三天发布，在“庚”日后三天再开始施行这些命令，才能使命令深入人心，从而使上下皆顺从，由此获得好的效果。\n《象》曰：九五之吉，位中正也。\n【白话】《象辞》说：《巽卦》的第五爻位（九五）之所以吉祥，是因为它居中端正，守持中道，慎始慎终。\n",
"上九，巽在床下，丧其资斧；贞凶。\n【白话】上九，谦卑恭顺到了极点而屈于床下，丧失了赖以谋生的资本，丧失了刚硬的本性，结果是凶险的。\n《象》曰：“巽在床下”，上穷也；“丧其资斧”，正乎凶也。\n【白话】《象辞》说：“谦卑恭顺到了极点而屈居于床下”，处于穷极末路，无法前进；“丧失了谋生的资本”，失去了生活的能力，结果必然是凶险的。\n"],
"兑卦":["初九，和兑，吉。\n【白话】初九，能以平和喜悦的态度待人，获得吉祥。\n《象》曰：和兑之吉，行未疑也。\n【白话】《象辞》说：用平和喜悦的态度待人，获得吉祥，是因为行为诚信端正，不被人猜疑。\n",
"九二，孚兑，吉，悔亡。\n【白话】九二，心中诚信与人和悦，故而得到吉祥；悔恨可以消失。\n《象》曰：“孚兑之吉”，信志也。\n【白话】《象辞》说：“心中诚信与人和悦，故而得到吉祥”，说明心志诚信、笃实，能获得好的结果。",
"六三，来兑，凶。\n【白话】六三，前来寻求欣悦，有凶险。\n《象》曰：“来兑之凶”，位不当也。\n【白话】《象辞》说：“前来导求欣悦，有凶险”，是因为居位不中不正的缘故。\n",
"九四，商兑，未宁，介疾有喜。\n【白话】九四刚居柔位，对喜悦能保持一定的警惕，有所思量，心绪不宁，须排除凶险疾恶才会有喜庆的结果。\n《象》曰：九四之喜，有庆也。\n【白话】《象辞》说：《兑卦》的第四爻位（九四）能拒绝诱惑，毅然守正，因此出现好的兆头，值得庆贺。\n",
"九五，孚于剥，有厉。\n【白话】九五，诚心相信小人的巧言令色，必有危险。\n《象》曰：“孚于剥”，位正当也！\n【白话】《象辞》说：“诚心相信小人的巧言令色必有危险”，只可惜它所居的正当之位了。",
"上六，引兑。\n【白话】上六，引诱别人一同欢悦。\n《象》曰：上六“引兑”，未光也。\n【白话】《象辞》说：《兑卦》的第六爻位（上六）“引诱别人一同欢悦”，不是光明正大的品行，而是偏离正德，这种所谓的欢悦将导致凶险。\n"],
"涣卦":["初六，用拯马壮吉。\n【白话】初六，借助健壮的好马来弥补力量的不足，可以获得吉祥。\n《象》曰：初六之吉，顺也。\n【白话】《象辞》说：《兑卦》的第一位（初六）之所以是吉祥的，这是由于它能顺承阳刚的缘故。\n",
"九二，涣奔其机，悔亡。\n【白话】九二，处在涣散之时，要迅速脱离险境，转移到安全的地方，悔恨便会消失。\n《象》曰：“涣奔其机”，得愿也。\n【白话】《象辞》说：“涣散之时，要迅速脱离险境，转移到安全的地方”，脱离了危险，消失了悔恨，实现了自己的愿望。\n",
"六三，涣其躬，无悔。\n【白话】六三，宁愿自身受到损失，因此没有什么悔恨。\n《象》曰：“涣其躬”，志在外也。\n【白话】《象辞》说：“宁愿自身受到损失”，说明志向在外。\n",
"六四，涣其群，元吉；涣有丘，匪夷所思。\n【白话】六四，尽散朋党，因而有大的吉祥；同时，它又能化解小群而聚成山丘一般大的群体，这不是常人所能想到的。\n《象》曰：“涣其群元吉”，光大也。\n【白话】《象辞》说：“尽散朋党，因而有大的吉祥”，表明无自私自利之心，品行光明正大。\n",
"九五，涣汗其大号，涣王居，无咎。\n【白话】九五，像挥发身上的汗水一样发布重大的命令，同时亦能疏散君王的积蓄用以聚拢民心，这样做一定不会有什么祸患。\n《象》曰：“王居无咎”，正位也。\n【白话】《象辞》说：“疏散君王的积蓄以聚拢民心，这样做一定不会有什么祸患”，是因为九五爻居于正位，行事端正。\n",
"上九，涣其血去逖出，无咎。\n【白话】上九，摆脱伤害，远远地避开它，不再接近它，不会有什么祸患。\n《象》曰：涣其血，远害也。\n【白话】《象辞》说：摆脱伤害，这就是避祸之道。\n"],
"节卦":["初九，不出户庭，无咎。\n【白话】初九，不迈出庭院，没有危害。\n《象》曰：“不出户庭”，知通塞也。\n【白话】《象辞》说：“不迈出庭院”，说明知晓通则当行，阻则当止的道理。",
"九二，不出门庭，凶。\n【白话】九二，因过分节制而不跨出门庭，会有凶险。\n《象》曰：“不出门庭”，失时极也。\n【白话】《象辞》说：“因过分节制而不跨出门庭”，因此失去了适中、妥当的时机。\n",
"六三，不节若，则嗟若，无咎。\n【白话】六三，虽不能节制，但能嗟叹自悔，则没有祸患。\n《象》曰：“不节之嗟”，又谁咎也！\n【白话】《象辞》说：“虽然不能节制，但能嗟叹自悔”，这样的话，又有谁能给它造成祸患呢？\n",
"六四，安节，亨。\n【白话】六四，能安然实行节制，故而亨通。\n《象》曰：“安节之亨”，承上道也。\n【白话】《象辞》说：“能安然实行节制，故而亨通”，说明谨守柔顺尊上之道。\n",
"九五，甘节，吉，往有尚。\n【白话】九五，能适度节制从而让人感到美而适中，是吉祥的；前行一定会受到褒奖。\n《象》曰：甘节之吉，位居中也。\n【白话】《象辞》说：“能适度节制从而让人感到美而适中，是吉祥的”，这是由于居位中正的缘故。\n",
"上六，苦节；贞凶，悔亡。\n【白话】上六，因节制过分，则会感到苦涩；而且会发生凶险，如果能对过分节制感到懊悔，则凶险有可能消失。\n《象》曰：“苦节贞凶”，其道穷也。\n【白话】《象辞》说：“因节制过分，则会感到苦涩，而且会发生凶险”，因为过分节制必然导致末路穷途。\n"],
"中孚":["初九，虞吉，有它不燕。\n【白话】初九，能安守诚信，可以获得吉祥，如果另有他求的话就会得不到安宁。\n《象》曰：初九“虞吉”，志未变也。\n【白话】《象辞》说：《中孚卦》的第一爻位（初九）“能安守诚信，可以获得吉祥”，是因为其没有他求的志向没有改变。",
"九二，鸣鹤在阴，其子和之；我有好爵，吾与尔靡之。\n【白话】鹤在山的北面鸣叫，它的那些同类们一声声地应和着它；我有醇香的酒浆，愿与你一同畅饮。\n《象》曰：其子和之，中心愿也。\n【白话】《象辞》说：“鹤的那些同类们一声声地应和着它”，说明它们表露出了内心的意愿。",
"六三，得敌，或鼓或罢，或泣或歌。\n【白话】六三，面临强劲的敌人，或者敲起战鼓发动进攻，或者兵疲将乏而致败退，或因为惧怕敌人的反击而哭泣，或由于敌人不加侵害而高兴地歌唱。\n《象》曰：“或鼓或罢”，位不当也。\n【白话】《象辞》说：“或者敲起战鼓发动进攻，或者兵疲将乏而致败退”，均是因为六三爻居位不正的缘故。\n",
"六四，月几望，马匹亡，无咎。\n【白话】六四，月亮将圆而未盈，好马失掉了匹配，不会有什么祸害。\n《象》曰：“马匹亡”，绝类上也。\n【白话】《象辞》说：“好马失掉了匹配”，是指六四爻诚信专一，断绝与同类之间的交往，而专心事奉君主",
"九五，有孚挛如，无咎。\n【白话】九五，具有诚信之德并以其牵系天下人心，天下的人也以诚信相和应，所以没有祸患。\n《象》曰：“有孚挛如”，位正当也。\n【白话】《象辞》说：“具有诚信之德并以其牵系天下人心”，是指居位中正适当，说明中心诚信这种教化作用可以施及整个邦国。",
"上九，翰音登于天，贞凶。\n【白话】上九，鸟高飞着，鸣叫声响彻天空，有可能出现凶险。\n《象》曰：“翰音登于天”，何可长也！\n【白话】《象辞》说：“鸟高飞着，鸣叫声响彻天空”，这种声音虚而不实，声高于情，怎么可能长久保持呢？\n"],
"小过":["初六，飞鸟以凶。\n【白话】初六，飞鸟向上强飞将会出现凶险。\n《象》曰：“飞鸟以凶”，不可如何也。\n【白话】《象辞》说：“飞鸟向上强飞将会出现凶险”，是咎由自取，无可奈何。",
"六二，过其祖，遇其妣；不及其君，遇其臣，无咎。\n【白话】六二，超过祖父，遇到祖母；但不能擅自越过君位，君臣遇合，一定没有祸患。\n《象》曰：“不及其君”，臣不可过也。\n【白话】《象辞》说：“不能擅自越过君位”，因为作为臣子是不能超越至尊的。\n",
"九三，弗过防之，从或戕之，凶。\n【白话】九三，自恃强盛而不愿过分防备，从而将要为人所害，故有凶险。\n《象》曰：“从或戕之”，凶如何也！\n【白话】《象辞》说：“将要为人所害”，说明面临的危险是多么的严重啊！\n",
"九四，无咎，弗过遇之；往厉必戒，勿用，永贞。\n【白话】九四，没有祸患，不过分恃强恃刚就能遇到阴柔；但是主动迎合阴柔会有凶险，因此，务必心存戒惕，不能去施展才用，要永远守中正之道。\n《象》曰：“弗过遇之”，位不当也；“往厉必戒”，终不可长也。\n【白话】《象辞》说：“不过分恃强恃刚就能遇到阴柔”，因为九四爻以刚居柔位，位置不正；“主动迎合阴柔会有凶险，务必要心存戒惕”，是说若主动迎合阴柔，最终将不可能长久无害。\n",
"六五，密云不雨，自我西郊；公弋取彼在穴。\n【白话】六五，乌云密布在天空而不下雨，这些乌云是从城的西边飘过来的；王公们用细绳系在箭上射取那些藏在穴中的野兽。\n《象》曰：密云不雨，已上也。\n【白话】《象辞》说：“乌云密布在天空而不下雨”，是因为阴气超过了阳气，阴阳不合，故而不能化雨。\n",
"上六，弗遇过之；飞鸟离之，凶，是谓灾眚。\n【白话】上六，不能遇合阳刚却超越了阳刚，无安栖之所的飞鸟遭受射杀之祸，故而凶险，这就叫做灾殃祸患。\n《象》曰：“弗遇过之”，已亢也。\n【白话】《象辞》说：“不能遇合阳刚而超越了阳刚”，是指其过分已达到极点，再危险不过了。"],
"既济":["初九，曳其轮，濡其尾，无咎。\n【白话】初九，拉住车的轮子，不使它快进，小狐狸渡河时沾湿了尾巴，无法快游，没有灾祸。\n《象》曰：“曳其轮”，义无咎也。\n【白话】《象辞》说：“拉住车的轮子，不使它快进”，说明事情成功之后，必须谨慎从事，小心防备，才没有灾祸。",
"六二，妇丧其茀，勿逐，七日得。\n【白话】六二，丢失了妇人乘车的遮帘，不用去寻找，过不了七天就会物归原处。\n《象》曰：“七日得”，以中道也。\n【白话】《象辞》说：“丢失妇人乘车上的遮帘，过不了七日就会物归原处”，说明此时正处于中位，坚守正道，不偏不倚，所以丢失了的东西可以失而复得。\n",
"九三，高宗伐鬼方，三年克之；小人勿用。\n【白话】九三，殷高宗武丁征伐地处西北的鬼方国，经过三年的连续战斗才获得胜利；不可任用急躁冒进的小人。\n《象》曰：“三年克之”惫也。\n【白话】《象辞》说：“经过三年的连续战斗才攻克了鬼方国”，说明战争非常激烈又持续了三年之久，已经筋疲力尽了，胜利是来之不易的。\n",
"六四，繻有衣袽，终日戒。\n【白话】六四，渡河的时候，为了防止船漏水，事先要准备破布棉絮，而且整天保持戒备，以防止发生灾祸。\n《象》曰：“终日戒”有所疑也。\n【白话】《象辞》说：“整天保持戒备，以防止灾祸的发生”，说明此时心中有所疑虑，感到恐惧。\n",
"九五，东邻杀牛，不如西郊之禴祭，实受其福。\n【白话】九五，东边邻国杀牛羊来举行盛大祭礼，不如西边的邻国举行简单而朴素的祭祀，这样才能实在地得到神降赐的福分。\n《象》曰：“东邻杀牛”，不如西邻之时也；“实受其福”，吉大来也。\n【白话】《象辞》说：“东边的邻国杀牛宰羊来举行盛大的祭礼”，还不如西边邻国能按时举行虔诚简单的时祭；西邻“实在地得到上天神灵降赐的福分”，说明此是正当其位，吉祥福分将不断隆临，非常幸运。",
"上六，濡其道，厉。\n【白话】上六，小狐狸渡河时弄湿了头，有危险。\n《象》曰：“濡其道，厉”，何可久也！\n【白话】《象辞》说：“小狐狸渡河时弄湿了头，有危险”，这是警告在事情成功之后，要更加小心谨慎，不然怎能长久不败！"],
"未济":["初六，濡其尾，吝。\n【白话】初六，小狐狸渡河时被水浸湿了尾巴，会有麻烦。\n《象》曰：“濡其尾”，亦不知极也。\n【白话】《象辞》说：“小狐狸渡河时被水浸湿了尾巴”，说明其自不量力，不知道自己究竟能使多大的气力，急躁冒进，结果招致麻烦。\n",
"九二，曳其轮，贞吉。\n【白话】九二，向后拖拉车轮，使车不快进，坚守正道可以得到吉祥。\n《象》曰：九二贞吉，中以行正也。\n【白话】《象辞》说：九二爻之所以可获吉祥，是因其恃中不移，端正不偏倚，有所节制，这样行事必获吉祥。\n",
"六三，未济，征凶，利涉大川。\n【白话】六三，事情未完成，急躁冒进去远行，有凶险，但有利于渡过大河急流。\n《象》曰：“未济，征凶”，位不当也。\n【白话】《象辞》说：“事情未完成，急躁冒进去远行，有凶险”，说明此时所处的位置不当。\n",
"九四，贞吉，悔亡；震用伐鬼方，三年有赏于大国。\n【白话】九四，坚守正道可获吉祥，悔恨会消失；以雷霆万钧之势征讨鬼方国，经过三年的激烈战斗终于得到了胜利，被封为一个大国的诸侯。\n《象》曰：“贞吉悔亡”，志行也。\n【白话】《象辞》说：“坚守正道可获吉祥，悔恨会消失”，说明实现了建功立业的志向。\n",
"六五，贞吉，无悔；君子之光，有孚吉。\n【白话】六五，坚守正道或获吉祥，没有什么悔恨；这是君子所具有的美德的光辉，有诚实守信的德行可以获得吉祥。\n《象》曰：“君子之光”其晖吉也。\n【白话】《象辞》说：“君子所具有的美德的光辉”，说明此时正在事情即将成功的关键时刻，应该具有诚实守信、光明正大的美德，才能获得成功，光彩焕发，得到吉祥。\n",
"上九，有孚于饮酒，无咎；濡其首，有孚失是。\n【白话】上九，满怀信心，充分信任众人，这时可以安闲自得地饮酒作乐，没有什么灾祸；纵情滥饮，被酒淋湿了头，则说明过分信任他人，将会损害君子的正道。\n《象》曰：饮酒濡首，亦不知节也。\n【白话】《象辞》说：“纵情滥饮，被酒淋湿了头”，这样喝得醉醺醺的，就会误了大事，就有灭顶之灾，这是放纵自己没有节制的结果。"]}